Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xa68 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x80382): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfloat-abi=soft -mthumb -march=armv7e-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x15f25): ../Core/Src/app_freertos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x3177f): C:/Users/adino/OneDrive/Documents/GitHub/flood-sensor/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 7	(unsigned)
    <33>   DW_AT_name        : (indirect string, offset: 0xf549): unsigned int
 <1><37>: Abbrev Number: 3 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x55174): long long int
 <1><3e>: Abbrev Number: 3 (DW_TAG_base_type)

    <4d>   DW_AT_name        : (indirect string, offset: 0x3657a): __uint8_t
    <51>   DW_AT_decl_file   : 2
    <52>   DW_AT_decl_line   : 43
    <53>   DW_AT_decl_column : 24
    <54>   DW_AT_type        : <0x58>
 <1><58>: Abbrev Number: 3 (DW_TAG_base_type)
    <59>   DW_AT_byte_size   : 1
    <5a>   DW_AT_encoding    : 8	(unsigned char)
    <5b>   DW_AT_name        : (indirect string, offset: 0x264fc): unsigned char
 <1><5f>: Abbrev Number: 3 (DW_TAG_base_type)
    <60>   DW_AT_byte_size   : 2
    <61>   DW_AT_encoding    : 5	(signed)
    <62>   DW_AT_name        : (indirect string, offset: 0x8a25f): short int
 <1><66>: Abbrev Number: 4 (DW_TAG_typedef)
    <67>   DW_AT_name        : (indirect string, offset: 0x981df): __uint16_t
    <6b>   DW_AT_decl_file   : 2
    <6c>   DW_AT_decl_line   : 57
    <6d>   DW_AT_decl_column : 25
    <6e>   DW_AT_type        : <0x72>
 <1><72>: Abbrev Number: 3 (DW_TAG_base_type)
    <73>   DW_AT_byte_size   : 2
    <74>   DW_AT_encoding    : 7	(unsigned)
    <75>   DW_AT_name        : (indirect string, offset: 0xb3001): short unsigned int
 <1><79>: Abbrev Number: 3 (DW_TAG_base_type)
    <7a>   DW_AT_byte_size   : 4
    <7b>   DW_AT_encoding    : 5	(signed)
    <7c>   DW_AT_name        : (indirect string, offset: 0xfc4c): long int
 <1><80>: Abbrev Number: 4 (DW_TAG_typedef)
    <81>   DW_AT_name        : (indirect string, offset: 0x767bb): __uint32_t
    <85>   DW_AT_decl_file   : 2
    <86>   DW_AT_decl_line   : 79
    <87>   DW_AT_decl_column : 25
    <88>   DW_AT_type        : <0x8c>
 <1><8c>: Abbrev Number: 3 (DW_TAG_base_type)
    <8d>   DW_AT_byte_size   : 4
    <8e>   DW_AT_encoding    : 7	(unsigned)
    <8f>   DW_AT_name        : (indirect string, offset: 0x2cc1d): long unsigned int
 <1><93>: Abbrev Number: 3 (DW_TAG_base_type)
    <94>   DW_AT_byte_size   : 8
    <95>   DW_AT_encoding    : 7	(unsigned)
    <96>   DW_AT_name        : (indirect string, offset: 0xa53f1): long long unsigned int
 <1><9a>: Abbrev Number: 4 (DW_TAG_typedef)
    <9b>   DW_AT_name        : (indirect string, offset: 0x3657c): uint8_t
    <9f>   DW_AT_decl_file   : 3
    <a0>   DW_AT_decl_line   : 24
    <a1>   DW_AT_decl_column : 19
    <a2>   DW_AT_type        : <0x4c>
 <1><a6>: Abbrev Number: 5 (DW_TAG_const_type)
    <a7>   DW_AT_type        : <0x9a>
 <1><ab>: Abbrev Number: 4 (DW_TAG_typedef)
    <ac>   DW_AT_name        : (indirect string, offset: 0x87a38): uint16_t
    <b0>   DW_AT_decl_file   : 3
    <b1>   DW_AT_decl_line   : 36
    <b2>   DW_AT_decl_column : 20
    <b3>   DW_AT_type        : <0x66>
 <1><b7>: Abbrev Number: 4 (DW_TAG_typedef)
    <b8>   DW_AT_name        : (indirect string, offset: 0x870a6): uint32_t
    <bc>   DW_AT_decl_file   : 3
    <bd>   DW_AT_decl_line   : 48
    <be>   DW_AT_decl_column : 20
    <bf>   DW_AT_type        : <0x80>
 <1><c3>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c4>   DW_AT_byte_size   : 4
 <1><c5>: Abbrev Number: 4 (DW_TAG_typedef)
    <c6>   DW_AT_name        : (indirect string, offset: 0x19fe5): StackType_t
    <ca>   DW_AT_decl_file   : 4
    <cb>   DW_AT_decl_line   : 55
    <cc>   DW_AT_decl_column : 24
    <cd>   DW_AT_type        : <0xb7>
 <1><d1>: Abbrev Number: 4 (DW_TAG_typedef)
    <d2>   DW_AT_name        : (indirect string, offset: 0xab871): UBaseType_t
    <d6>   DW_AT_decl_file   : 4
    <d7>   DW_AT_decl_line   : 57
    <d8>   DW_AT_decl_column : 23
    <d9>   DW_AT_type        : <0x8c>
 <1><dd>: Abbrev Number: 4 (DW_TAG_typedef)
    <de>   DW_AT_name        : (indirect string, offset: 0x66ef8): TickType_t
    <e2>   DW_AT_decl_file   : 4
    <e3>   DW_AT_decl_line   : 63
    <e4>   DW_AT_decl_column : 19
    <e5>   DW_AT_type        : <0xb7>
 <1><e9>: Abbrev Number: 7 (DW_TAG_typedef)
    <ea>   DW_AT_name        : (indirect string, offset: 0x88ac8): wint_t
    <ee>   DW_AT_decl_file   : 5
    <ef>   DW_AT_decl_line   : 350
    <f1>   DW_AT_decl_column : 23
    <f2>   DW_AT_type        : <0x30>
 <1><f6>: Abbrev Number: 4 (DW_TAG_typedef)
    <f7>   DW_AT_name        : (indirect string, offset: 0xbe76d): _off_t
    <fb>   DW_AT_decl_file   : 6
    <fc>   DW_AT_decl_line   : 46
    <fd>   DW_AT_decl_column : 14
    <fe>   DW_AT_type        : <0x79>
 <1><102>: Abbrev Number: 4 (DW_TAG_typedef)
    <103>   DW_AT_name        : (indirect string, offset: 0x29e47): _fpos_t
    <107>   DW_AT_decl_file   : 6
    <108>   DW_AT_decl_line   : 116
    <109>   DW_AT_decl_column : 14
    <10a>   DW_AT_type        : <0x79>
 <1><10e>: Abbrev Number: 8 (DW_TAG_union_type)
    <10f>   DW_AT_byte_size   : 4
    <110>   DW_AT_decl_file   : 6
    <111>   DW_AT_decl_line   : 165
    <112>   DW_AT_decl_column : 3
    <113>   DW_AT_sibling     : <0x130>
 <2><117>: Abbrev Number: 9 (DW_TAG_member)
    <118>   DW_AT_name        : (indirect string, offset: 0x8e75f): __wch
    <11c>   DW_AT_decl_file   : 6
    <11d>   DW_AT_decl_line   : 167
    <11e>   DW_AT_decl_column : 12
    <11f>   DW_AT_type        : <0xe9>
 <2><123>: Abbrev Number: 9 (DW_TAG_member)
    <124>   DW_AT_name        : (indirect string, offset: 0x5fece): __wchb
    <128>   DW_AT_decl_file   : 6
    <129>   DW_AT_decl_line   : 168
    <12a>   DW_AT_decl_column : 19
    <12b>   DW_AT_type        : <0x130>
 <2><12f>: Abbrev Number: 0
 <1><130>: Abbrev Number: 10 (DW_TAG_array_type)
    <131>   DW_AT_type        : <0x58>
    <135>   DW_AT_sibling     : <0x140>
 <2><139>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <13a>   DW_AT_type        : <0x30>
    <13e>   DW_AT_upper_bound : 3
 <2><13f>: Abbrev Number: 0
 <1><140>: Abbrev Number: 12 (DW_TAG_structure_type)
    <141>   DW_AT_byte_size   : 8
    <142>   DW_AT_decl_file   : 6
    <143>   DW_AT_decl_line   : 162
    <144>   DW_AT_decl_column : 9
    <145>   DW_AT_sibling     : <0x164>
 <2><149>: Abbrev Number: 13 (DW_TAG_member)
    <14a>   DW_AT_name        : (indirect string, offset: 0x34ddb): __count
    <14e>   DW_AT_decl_file   : 6
    <14f>   DW_AT_decl_line   : 164
    <150>   DW_AT_decl_column : 7
    <151>   DW_AT_type        : <0x29>
    <155>   DW_AT_data_member_location: 0
 <2><156>: Abbrev Number: 13 (DW_TAG_member)
    <157>   DW_AT_name        : (indirect string, offset: 0x6b16c): __value
    <15b>   DW_AT_decl_file   : 6
    <15c>   DW_AT_decl_line   : 169
    <15d>   DW_AT_decl_column : 5
    <15e>   DW_AT_type        : <0x10e>
    <162>   DW_AT_data_member_location: 4
 <2><163>: Abbrev Number: 0
 <1><164>: Abbrev Number: 4 (DW_TAG_typedef)
    <165>   DW_AT_name        : (indirect string, offset: 0x61cce): _mbstate_t
    <169>   DW_AT_decl_file   : 6
    <16a>   DW_AT_decl_line   : 170
    <16b>   DW_AT_decl_column : 3
    <16c>   DW_AT_type        : <0x140>
 <1><170>: Abbrev Number: 4 (DW_TAG_typedef)
    <171>   DW_AT_name        : (indirect string, offset: 0x656ca): __ULong
    <175>   DW_AT_decl_file   : 7
    <176>   DW_AT_decl_line   : 22
    <177>   DW_AT_decl_column : 25
    <178>   DW_AT_type        : <0x8c>
 <1><17c>: Abbrev Number: 4 (DW_TAG_typedef)
    <17d>   DW_AT_name        : (indirect string, offset: 0x669fa): _LOCK_T
    <181>   DW_AT_decl_file   : 8
    <182>   DW_AT_decl_line   : 34
    <183>   DW_AT_decl_column : 25
    <184>   DW_AT_type        : <0x188>
 <1><188>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <189>   DW_AT_byte_size   : 4
    <18a>   DW_AT_type        : <0x18e>
 <1><18e>: Abbrev Number: 15 (DW_TAG_structure_type)
    <18f>   DW_AT_name        : (indirect string, offset: 0x17776): __lock
    <193>   DW_AT_declaration : 1
 <1><193>: Abbrev Number: 4 (DW_TAG_typedef)
    <194>   DW_AT_name        : (indirect string, offset: 0x5c167): _flock_t
    <198>   DW_AT_decl_file   : 7
    <199>   DW_AT_decl_line   : 35
    <19a>   DW_AT_decl_column : 27
    <19b>   DW_AT_type        : <0x17c>
 <1><19f>: Abbrev Number: 16 (DW_TAG_structure_type)
    <1a0>   DW_AT_name        : (indirect string, offset: 0x40dc7): _Bigint
    <1a4>   DW_AT_byte_size   : 24
    <1a5>   DW_AT_decl_file   : 7
    <1a6>   DW_AT_decl_line   : 52
    <1a7>   DW_AT_decl_column : 8
    <1a8>   DW_AT_sibling     : <0x1f9>
 <2><1ac>: Abbrev Number: 13 (DW_TAG_member)
    <1ad>   DW_AT_name        : (indirect string, offset: 0x6f26d): _next
    <1b1>   DW_AT_decl_file   : 7
    <1b2>   DW_AT_decl_line   : 54
    <1b3>   DW_AT_decl_column : 19
    <1b4>   DW_AT_type        : <0x1f9>
    <1b8>   DW_AT_data_member_location: 0
 <2><1b9>: Abbrev Number: 17 (DW_TAG_member)
    <1ba>   DW_AT_name        : _k
    <1bd>   DW_AT_decl_file   : 7
    <1be>   DW_AT_decl_line   : 55
    <1bf>   DW_AT_decl_column : 7
    <1c0>   DW_AT_type        : <0x29>
    <1c4>   DW_AT_data_member_location: 4
 <2><1c5>: Abbrev Number: 13 (DW_TAG_member)
    <1c6>   DW_AT_name        : (indirect string, offset: 0x850d2): _maxwds
    <1ca>   DW_AT_decl_file   : 7
    <1cb>   DW_AT_decl_line   : 55
    <1cc>   DW_AT_decl_column : 11
    <1cd>   DW_AT_type        : <0x29>
    <1d1>   DW_AT_data_member_location: 8
 <2><1d2>: Abbrev Number: 13 (DW_TAG_member)
    <1d3>   DW_AT_name        : (indirect string, offset: 0x637ca): _sign
    <1d7>   DW_AT_decl_file   : 7
    <1d8>   DW_AT_decl_line   : 55
    <1d9>   DW_AT_decl_column : 20
    <1da>   DW_AT_type        : <0x29>
    <1de>   DW_AT_data_member_location: 12
 <2><1df>: Abbrev Number: 13 (DW_TAG_member)
    <1e0>   DW_AT_name        : (indirect string, offset: 0x6353f): _wds
    <1e4>   DW_AT_decl_file   : 7
    <1e5>   DW_AT_decl_line   : 55
    <1e6>   DW_AT_decl_column : 27
    <1e7>   DW_AT_type        : <0x29>
    <1eb>   DW_AT_data_member_location: 16
 <2><1ec>: Abbrev Number: 17 (DW_TAG_member)
    <1ed>   DW_AT_name        : _x
    <1f0>   DW_AT_decl_file   : 7
    <1f1>   DW_AT_decl_line   : 56
    <1f2>   DW_AT_decl_column : 11
    <1f3>   DW_AT_type        : <0x1ff>
    <1f7>   DW_AT_data_member_location: 20
 <2><1f8>: Abbrev Number: 0
 <1><1f9>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <1fa>   DW_AT_byte_size   : 4
    <1fb>   DW_AT_type        : <0x19f>
 <1><1ff>: Abbrev Number: 10 (DW_TAG_array_type)
    <200>   DW_AT_type        : <0x170>
    <204>   DW_AT_sibling     : <0x20f>
 <2><208>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <209>   DW_AT_type        : <0x30>
    <20d>   DW_AT_upper_bound : 0
 <2><20e>: Abbrev Number: 0
 <1><20f>: Abbrev Number: 16 (DW_TAG_structure_type)
    <210>   DW_AT_name        : (indirect string, offset: 0x3357b): __tm
    <214>   DW_AT_byte_size   : 36
    <215>   DW_AT_decl_file   : 7
    <216>   DW_AT_decl_line   : 60
    <217>   DW_AT_decl_column : 8
    <218>   DW_AT_sibling     : <0x292>
 <2><21c>: Abbrev Number: 13 (DW_TAG_member)
    <21d>   DW_AT_name        : (indirect string, offset: 0xb7c01): __tm_sec
    <221>   DW_AT_decl_file   : 7
    <222>   DW_AT_decl_line   : 62
    <223>   DW_AT_decl_column : 9
    <224>   DW_AT_type        : <0x29>
    <228>   DW_AT_data_member_location: 0
 <2><229>: Abbrev Number: 13 (DW_TAG_member)
    <22a>   DW_AT_name        : (indirect string, offset: 0x82b6c): __tm_min
    <22e>   DW_AT_decl_file   : 7
    <22f>   DW_AT_decl_line   : 63
    <230>   DW_AT_decl_column : 9
    <231>   DW_AT_type        : <0x29>
    <235>   DW_AT_data_member_location: 4
 <2><236>: Abbrev Number: 13 (DW_TAG_member)
    <237>   DW_AT_name        : (indirect string, offset: 0x2825f): __tm_hour
    <23b>   DW_AT_decl_file   : 7
    <23c>   DW_AT_decl_line   : 64
    <23d>   DW_AT_decl_column : 9
    <23e>   DW_AT_type        : <0x29>
    <242>   DW_AT_data_member_location: 8
 <2><243>: Abbrev Number: 13 (DW_TAG_member)
    <244>   DW_AT_name        : (indirect string, offset: 0x6d60a): __tm_mday
    <248>   DW_AT_decl_file   : 7
    <249>   DW_AT_decl_line   : 65
    <24a>   DW_AT_decl_column : 9
    <24b>   DW_AT_type        : <0x29>
    <24f>   DW_AT_data_member_location: 12
 <2><250>: Abbrev Number: 13 (DW_TAG_member)
    <251>   DW_AT_name        : (indirect string, offset: 0x33a9): __tm_mon
    <255>   DW_AT_decl_file   : 7
    <256>   DW_AT_decl_line   : 66
    <257>   DW_AT_decl_column : 9
    <258>   DW_AT_type        : <0x29>
    <25c>   DW_AT_data_member_location: 16
 <2><25d>: Abbrev Number: 13 (DW_TAG_member)
    <25e>   DW_AT_name        : (indirect string, offset: 0xad3ed): __tm_year
    <262>   DW_AT_decl_file   : 7
    <263>   DW_AT_decl_line   : 67
    <264>   DW_AT_decl_column : 9
    <265>   DW_AT_type        : <0x29>
    <269>   DW_AT_data_member_location: 20
 <2><26a>: Abbrev Number: 13 (DW_TAG_member)
    <26b>   DW_AT_name        : (indirect string, offset: 0x4e836): __tm_wday
    <26f>   DW_AT_decl_file   : 7
    <270>   DW_AT_decl_line   : 68
    <271>   DW_AT_decl_column : 9
    <272>   DW_AT_type        : <0x29>
    <276>   DW_AT_data_member_location: 24
 <2><277>: Abbrev Number: 13 (DW_TAG_member)
    <278>   DW_AT_name        : (indirect string, offset: 0x92f78): __tm_yday
    <27c>   DW_AT_decl_file   : 7
    <27d>   DW_AT_decl_line   : 69
    <27e>   DW_AT_decl_column : 9
    <27f>   DW_AT_type        : <0x29>
    <283>   DW_AT_data_member_location: 28
 <2><284>: Abbrev Number: 13 (DW_TAG_member)
    <285>   DW_AT_name        : (indirect string, offset: 0xa7c56): __tm_isdst
    <289>   DW_AT_decl_file   : 7
    <28a>   DW_AT_decl_line   : 70
    <28b>   DW_AT_decl_column : 9
    <28c>   DW_AT_type        : <0x29>
    <290>   DW_AT_data_member_location: 32
 <2><291>: Abbrev Number: 0
 <1><292>: Abbrev Number: 16 (DW_TAG_structure_type)
    <293>   DW_AT_name        : (indirect string, offset: 0x7c5bf): __sbuf
    <297>   DW_AT_byte_size   : 8
    <298>   DW_AT_decl_file   : 7
    <299>   DW_AT_decl_line   : 122
    <29a>   DW_AT_decl_column : 8
    <29b>   DW_AT_sibling     : <0x2ba>
 <2><29f>: Abbrev Number: 13 (DW_TAG_member)
    <2a0>   DW_AT_name        : (indirect string, offset: 0x3dee5): _base
    <2a4>   DW_AT_decl_file   : 7
    <2a5>   DW_AT_decl_line   : 123
    <2a6>   DW_AT_decl_column : 17
    <2a7>   DW_AT_type        : <0x2ba>
    <2ab>   DW_AT_data_member_location: 0
 <2><2ac>: Abbrev Number: 13 (DW_TAG_member)
    <2ad>   DW_AT_name        : (indirect string, offset: 0xbe267): _size
    <2b1>   DW_AT_decl_file   : 7
    <2b2>   DW_AT_decl_line   : 124
    <2b3>   DW_AT_decl_column : 6
    <2b4>   DW_AT_type        : <0x29>
    <2b8>   DW_AT_data_member_location: 4
 <2><2b9>: Abbrev Number: 0
 <1><2ba>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <2bb>   DW_AT_byte_size   : 4
    <2bc>   DW_AT_type        : <0x58>
 <1><2c0>: Abbrev Number: 18 (DW_TAG_structure_type)
    <2c1>   DW_AT_name        : (indirect string, offset: 0xc86c5): _reent
    <2c5>   DW_AT_byte_size   : 96
    <2c6>   DW_AT_decl_file   : 7
    <2c7>   DW_AT_decl_line   : 377
    <2c9>   DW_AT_decl_column : 8
    <2ca>   DW_AT_sibling     : <0x403>
 <2><2ce>: Abbrev Number: 19 (DW_TAG_member)
    <2cf>   DW_AT_name        : (indirect string, offset: 0xbe40c): _errno
    <2d3>   DW_AT_decl_file   : 7
    <2d4>   DW_AT_decl_line   : 381
    <2d6>   DW_AT_decl_column : 7
    <2d7>   DW_AT_type        : <0x29>
    <2db>   DW_AT_data_member_location: 0
 <2><2dc>: Abbrev Number: 19 (DW_TAG_member)
    <2dd>   DW_AT_name        : (indirect string, offset: 0xc7c6b): _stdin
    <2e1>   DW_AT_decl_file   : 7
    <2e2>   DW_AT_decl_line   : 386
    <2e4>   DW_AT_decl_column : 11
    <2e5>   DW_AT_type        : <0x656>
    <2e9>   DW_AT_data_member_location: 4
 <2><2ea>: Abbrev Number: 19 (DW_TAG_member)
    <2eb>   DW_AT_name        : (indirect string, offset: 0xc85a8): _stdout
    <2ef>   DW_AT_decl_file   : 7
    <2f0>   DW_AT_decl_line   : 386
    <2f2>   DW_AT_decl_column : 20
    <2f3>   DW_AT_type        : <0x656>
    <2f7>   DW_AT_data_member_location: 8
 <2><2f8>: Abbrev Number: 19 (DW_TAG_member)
    <2f9>   DW_AT_name        : (indirect string, offset: 0xc8551): _stderr
    <2fd>   DW_AT_decl_file   : 7
    <2fe>   DW_AT_decl_line   : 386
    <300>   DW_AT_decl_column : 30
    <301>   DW_AT_type        : <0x656>
    <305>   DW_AT_data_member_location: 12
 <2><306>: Abbrev Number: 19 (DW_TAG_member)
    <307>   DW_AT_name        : (indirect string, offset: 0x75f15): _inc
    <30b>   DW_AT_decl_file   : 7
    <30c>   DW_AT_decl_line   : 388
    <30e>   DW_AT_decl_column : 8
    <30f>   DW_AT_type        : <0x29>
    <313>   DW_AT_data_member_location: 16
 <2><314>: Abbrev Number: 19 (DW_TAG_member)
    <315>   DW_AT_name        : (indirect string, offset: 0x3fa3b): _emergency
    <319>   DW_AT_decl_file   : 7
    <31a>   DW_AT_decl_line   : 390
    <31c>   DW_AT_decl_column : 9
    <31d>   DW_AT_type        : <0x56a>
    <321>   DW_AT_data_member_location: 20
 <2><322>: Abbrev Number: 19 (DW_TAG_member)
    <323>   DW_AT_name        : (indirect string, offset: 0x50ac9): __sdidinit
    <327>   DW_AT_decl_file   : 7
    <328>   DW_AT_decl_line   : 392
    <32a>   DW_AT_decl_column : 7
    <32b>   DW_AT_type        : <0x29>
    <32f>   DW_AT_data_member_location: 24
 <2><330>: Abbrev Number: 19 (DW_TAG_member)
    <331>   DW_AT_name        : (indirect string, offset: 0xa513a): _unspecified_locale_info
    <335>   DW_AT_decl_file   : 7
    <336>   DW_AT_decl_line   : 394
    <338>   DW_AT_decl_column : 7
    <339>   DW_AT_type        : <0x29>
    <33d>   DW_AT_data_member_location: 28
 <2><33e>: Abbrev Number: 19 (DW_TAG_member)
    <33f>   DW_AT_name        : (indirect string, offset: 0xa50b5): _locale
    <343>   DW_AT_decl_file   : 7
    <344>   DW_AT_decl_line   : 395
    <346>   DW_AT_decl_column : 22
    <347>   DW_AT_type        : <0x7be>
    <34b>   DW_AT_data_member_location: 32
 <2><34c>: Abbrev Number: 20 (DW_TAG_member)
    <34d>   DW_AT_name        : _mp
    <351>   DW_AT_decl_file   : 7
    <352>   DW_AT_decl_line   : 397
    <354>   DW_AT_decl_column : 18
    <355>   DW_AT_type        : <0x7c4>
    <359>   DW_AT_data_member_location: 36
 <2><35a>: Abbrev Number: 19 (DW_TAG_member)
    <35b>   DW_AT_name        : (indirect string, offset: 0x1d163): __cleanup
    <35f>   DW_AT_decl_file   : 7
    <360>   DW_AT_decl_line   : 399
    <362>   DW_AT_decl_column : 10
    <363>   DW_AT_type        : <0x7d5>
    <367>   DW_AT_data_member_location: 40
 <2><368>: Abbrev Number: 19 (DW_TAG_member)
    <369>   DW_AT_name        : (indirect string, offset: 0x2f508): _gamma_signgam
    <36d>   DW_AT_decl_file   : 7
    <36e>   DW_AT_decl_line   : 401
    <370>   DW_AT_decl_column : 7
    <371>   DW_AT_type        : <0x29>
    <375>   DW_AT_data_member_location: 44
 <2><376>: Abbrev Number: 19 (DW_TAG_member)
    <377>   DW_AT_name        : (indirect string, offset: 0x9530f): _cvtlen
    <37b>   DW_AT_decl_file   : 7
    <37c>   DW_AT_decl_line   : 404
    <37e>   DW_AT_decl_column : 7
    <37f>   DW_AT_type        : <0x29>
    <383>   DW_AT_data_member_location: 48
 <2><384>: Abbrev Number: 19 (DW_TAG_member)
    <385>   DW_AT_name        : (indirect string, offset: 0x561a9): _cvtbuf
    <389>   DW_AT_decl_file   : 7
    <38a>   DW_AT_decl_line   : 405
    <38c>   DW_AT_decl_column : 9
    <38d>   DW_AT_type        : <0x56a>
    <391>   DW_AT_data_member_location: 52
 <2><392>: Abbrev Number: 19 (DW_TAG_member)
    <393>   DW_AT_name        : (indirect string, offset: 0x8a811): _r48
    <397>   DW_AT_decl_file   : 7
    <398>   DW_AT_decl_line   : 407
    <39a>   DW_AT_decl_column : 19
    <39b>   DW_AT_type        : <0x7db>
    <39f>   DW_AT_data_member_location: 56
 <2><3a0>: Abbrev Number: 19 (DW_TAG_member)
    <3a1>   DW_AT_name        : (indirect string, offset: 0x9b3ff): _localtime_buf
    <3a5>   DW_AT_decl_file   : 7
    <3a6>   DW_AT_decl_line   : 408
    <3a8>   DW_AT_decl_column : 16
    <3a9>   DW_AT_type        : <0x7e1>
    <3ad>   DW_AT_data_member_location: 60
 <2><3ae>: Abbrev Number: 19 (DW_TAG_member)
    <3af>   DW_AT_name        : (indirect string, offset: 0x2a0d2): _asctime_buf
    <3b3>   DW_AT_decl_file   : 7
    <3b4>   DW_AT_decl_line   : 409
    <3b6>   DW_AT_decl_column : 9
    <3b7>   DW_AT_type        : <0x56a>
    <3bb>   DW_AT_data_member_location: 64
 <2><3bc>: Abbrev Number: 19 (DW_TAG_member)
    <3bd>   DW_AT_name        : (indirect string, offset: 0x9920): _sig_func
    <3c1>   DW_AT_decl_file   : 7
    <3c2>   DW_AT_decl_line   : 412
    <3c4>   DW_AT_decl_column : 12
    <3c5>   DW_AT_type        : <0x7f2>
    <3c9>   DW_AT_data_member_location: 68
 <2><3ca>: Abbrev Number: 19 (DW_TAG_member)
    <3cb>   DW_AT_name        : (indirect string, offset: 0x84f6f): __sglue
    <3cf>   DW_AT_decl_file   : 7
    <3d0>   DW_AT_decl_line   : 420
    <3d2>   DW_AT_decl_column : 16
    <3d3>   DW_AT_type        : <0x617>
    <3d7>   DW_AT_data_member_location: 72
 <2><3d8>: Abbrev Number: 19 (DW_TAG_member)
    <3d9>   DW_AT_name        : (indirect string, offset: 0x32f02): __sf
    <3dd>   DW_AT_decl_file   : 7
    <3de>   DW_AT_decl_line   : 421
    <3e0>   DW_AT_decl_column : 11
    <3e1>   DW_AT_type        : <0x656>
    <3e5>   DW_AT_data_member_location: 84
 <2><3e6>: Abbrev Number: 19 (DW_TAG_member)
    <3e7>   DW_AT_name        : (indirect string, offset: 0x546d4): _misc
    <3eb>   DW_AT_decl_file   : 7
    <3ec>   DW_AT_decl_line   : 422
    <3ee>   DW_AT_decl_column : 23
    <3ef>   DW_AT_type        : <0x7fe>
    <3f3>   DW_AT_data_member_location: 88
 <2><3f4>: Abbrev Number: 19 (DW_TAG_member)
    <3f5>   DW_AT_name        : (indirect string, offset: 0x7425a): _signal_buf
    <3f9>   DW_AT_decl_file   : 7
    <3fa>   DW_AT_decl_line   : 423
    <3fc>   DW_AT_decl_column : 9
    <3fd>   DW_AT_type        : <0x56a>
    <401>   DW_AT_data_member_location: 92
 <2><402>: Abbrev Number: 0
 <1><403>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <404>   DW_AT_byte_size   : 4
    <405>   DW_AT_type        : <0x2c0>
 <1><409>: Abbrev Number: 16 (DW_TAG_structure_type)
    <40a>   DW_AT_name        : (indirect string, offset: 0x8e3f0): __sFILE
    <40e>   DW_AT_byte_size   : 104
    <40f>   DW_AT_decl_file   : 7
    <410>   DW_AT_decl_line   : 186
    <411>   DW_AT_decl_column : 8
    <412>   DW_AT_sibling     : <0x54c>
 <2><416>: Abbrev Number: 17 (DW_TAG_member)
    <417>   DW_AT_name        : _p
    <41a>   DW_AT_decl_file   : 7
    <41b>   DW_AT_decl_line   : 187
    <41c>   DW_AT_decl_column : 18
    <41d>   DW_AT_type        : <0x2ba>
    <421>   DW_AT_data_member_location: 0
 <2><422>: Abbrev Number: 17 (DW_TAG_member)
    <423>   DW_AT_name        : _r
    <426>   DW_AT_decl_file   : 7
    <427>   DW_AT_decl_line   : 188
    <428>   DW_AT_decl_column : 7
    <429>   DW_AT_type        : <0x29>
    <42d>   DW_AT_data_member_location: 4
 <2><42e>: Abbrev Number: 17 (DW_TAG_member)
    <42f>   DW_AT_name        : _w
    <432>   DW_AT_decl_file   : 7
    <433>   DW_AT_decl_line   : 189
    <434>   DW_AT_decl_column : 7
    <435>   DW_AT_type        : <0x29>
    <439>   DW_AT_data_member_location: 8
 <2><43a>: Abbrev Number: 13 (DW_TAG_member)
    <43b>   DW_AT_name        : (indirect string, offset: 0x2c77e): _flags
    <43f>   DW_AT_decl_file   : 7
    <440>   DW_AT_decl_line   : 190
    <441>   DW_AT_decl_column : 9
    <442>   DW_AT_type        : <0x5f>
    <446>   DW_AT_data_member_location: 12
 <2><447>: Abbrev Number: 13 (DW_TAG_member)
    <448>   DW_AT_name        : (indirect string, offset: 0x1c478): _file
    <44c>   DW_AT_decl_file   : 7
    <44d>   DW_AT_decl_line   : 191
    <44e>   DW_AT_decl_column : 9
    <44f>   DW_AT_type        : <0x5f>
    <453>   DW_AT_data_member_location: 14
 <2><454>: Abbrev Number: 17 (DW_TAG_member)
    <455>   DW_AT_name        : _bf
    <459>   DW_AT_decl_file   : 7
    <45a>   DW_AT_decl_line   : 192
    <45b>   DW_AT_decl_column : 17
    <45c>   DW_AT_type        : <0x292>
    <460>   DW_AT_data_member_location: 16
 <2><461>: Abbrev Number: 13 (DW_TAG_member)
    <462>   DW_AT_name        : (indirect string, offset: 0x1a0a0): _lbfsize
    <466>   DW_AT_decl_file   : 7
    <467>   DW_AT_decl_line   : 193
    <468>   DW_AT_decl_column : 7
    <469>   DW_AT_type        : <0x29>
    <46d>   DW_AT_data_member_location: 24
 <2><46e>: Abbrev Number: 13 (DW_TAG_member)
    <46f>   DW_AT_name        : (indirect string, offset: 0xc5fa6): _data
    <473>   DW_AT_decl_file   : 7
    <474>   DW_AT_decl_line   : 196
    <475>   DW_AT_decl_column : 18
    <476>   DW_AT_type        : <0x403>
    <47a>   DW_AT_data_member_location: 28
 <2><47b>: Abbrev Number: 13 (DW_TAG_member)
    <47c>   DW_AT_name        : (indirect string, offset: 0xa6038): _cookie
    <480>   DW_AT_decl_file   : 7
    <481>   DW_AT_decl_line   : 200
    <482>   DW_AT_decl_column : 10
    <483>   DW_AT_type        : <0xc3>
    <487>   DW_AT_data_member_location: 32
 <2><488>: Abbrev Number: 13 (DW_TAG_member)
    <489>   DW_AT_name        : (indirect string, offset: 0x9259c): _read
    <48d>   DW_AT_decl_file   : 7
    <48e>   DW_AT_decl_line   : 202
    <48f>   DW_AT_decl_column : 29
    <490>   DW_AT_type        : <0x57c>
    <494>   DW_AT_data_member_location: 36
 <2><495>: Abbrev Number: 13 (DW_TAG_member)
    <496>   DW_AT_name        : (indirect string, offset: 0x177ac): _write
    <49a>   DW_AT_decl_file   : 7
    <49b>   DW_AT_decl_line   : 204
    <49c>   DW_AT_decl_column : 29
    <49d>   DW_AT_type        : <0x5a6>
    <4a1>   DW_AT_data_member_location: 40
 <2><4a2>: Abbrev Number: 13 (DW_TAG_member)
    <4a3>   DW_AT_name        : (indirect string, offset: 0x36843): _seek
    <4a7>   DW_AT_decl_file   : 7
    <4a8>   DW_AT_decl_line   : 207
    <4a9>   DW_AT_decl_column : 13
    <4aa>   DW_AT_type        : <0x5ca>
    <4ae>   DW_AT_data_member_location: 44
 <2><4af>: Abbrev Number: 13 (DW_TAG_member)
    <4b0>   DW_AT_name        : (indirect string, offset: 0x51b60): _close
    <4b4>   DW_AT_decl_file   : 7
    <4b5>   DW_AT_decl_line   : 208
    <4b6>   DW_AT_decl_column : 9
    <4b7>   DW_AT_type        : <0x5e4>
    <4bb>   DW_AT_data_member_location: 48
 <2><4bc>: Abbrev Number: 17 (DW_TAG_member)
    <4bd>   DW_AT_name        : _ub
    <4c1>   DW_AT_decl_file   : 7
    <4c2>   DW_AT_decl_line   : 211
    <4c3>   DW_AT_decl_column : 17
    <4c4>   DW_AT_type        : <0x292>
    <4c8>   DW_AT_data_member_location: 52
 <2><4c9>: Abbrev Number: 17 (DW_TAG_member)
    <4ca>   DW_AT_name        : _up
    <4ce>   DW_AT_decl_file   : 7
    <4cf>   DW_AT_decl_line   : 212
    <4d0>   DW_AT_decl_column : 18
    <4d1>   DW_AT_type        : <0x2ba>
    <4d5>   DW_AT_data_member_location: 60
 <2><4d6>: Abbrev Number: 17 (DW_TAG_member)
    <4d7>   DW_AT_name        : _ur
    <4db>   DW_AT_decl_file   : 7
    <4dc>   DW_AT_decl_line   : 213
    <4dd>   DW_AT_decl_column : 7
    <4de>   DW_AT_type        : <0x29>
    <4e2>   DW_AT_data_member_location: 64
 <2><4e3>: Abbrev Number: 13 (DW_TAG_member)
    <4e4>   DW_AT_name        : (indirect string, offset: 0x33085): _ubuf
    <4e8>   DW_AT_decl_file   : 7
    <4e9>   DW_AT_decl_line   : 216
    <4ea>   DW_AT_decl_column : 17
    <4eb>   DW_AT_type        : <0x5ea>
    <4ef>   DW_AT_data_member_location: 68
 <2><4f0>: Abbrev Number: 13 (DW_TAG_member)
    <4f1>   DW_AT_name        : (indirect string, offset: 0x7ee8c): _nbuf
    <4f5>   DW_AT_decl_file   : 7
    <4f6>   DW_AT_decl_line   : 217
    <4f7>   DW_AT_decl_column : 17
    <4f8>   DW_AT_type        : <0x5fa>
    <4fc>   DW_AT_data_member_location: 71
 <2><4fd>: Abbrev Number: 17 (DW_TAG_member)
    <4fe>   DW_AT_name        : _lb
    <502>   DW_AT_decl_file   : 7
    <503>   DW_AT_decl_line   : 220
    <504>   DW_AT_decl_column : 17
    <505>   DW_AT_type        : <0x292>
    <509>   DW_AT_data_member_location: 72
 <2><50a>: Abbrev Number: 13 (DW_TAG_member)
    <50b>   DW_AT_name        : (indirect string, offset: 0xbdf3f): _blksize
    <50f>   DW_AT_decl_file   : 7
    <510>   DW_AT_decl_line   : 223
    <511>   DW_AT_decl_column : 7
    <512>   DW_AT_type        : <0x29>
    <516>   DW_AT_data_member_location: 80
 <2><517>: Abbrev Number: 13 (DW_TAG_member)
    <518>   DW_AT_name        : (indirect string, offset: 0x3bc07): _offset
    <51c>   DW_AT_decl_file   : 7
    <51d>   DW_AT_decl_line   : 224
    <51e>   DW_AT_decl_column : 10
    <51f>   DW_AT_type        : <0xf6>
    <523>   DW_AT_data_member_location: 84
 <2><524>: Abbrev Number: 13 (DW_TAG_member)
    <525>   DW_AT_name        : (indirect string, offset: 0x17777): _lock
    <529>   DW_AT_decl_file   : 7
    <52a>   DW_AT_decl_line   : 231
    <52b>   DW_AT_decl_column : 12
    <52c>   DW_AT_type        : <0x193>
    <530>   DW_AT_data_member_location: 88
 <2><531>: Abbrev Number: 13 (DW_TAG_member)
    <532>   DW_AT_name        : (indirect string, offset: 0x8d4da): _mbstate
    <536>   DW_AT_decl_file   : 7
    <537>   DW_AT_decl_line   : 233
    <538>   DW_AT_decl_column : 14
    <539>   DW_AT_type        : <0x164>
    <53d>   DW_AT_data_member_location: 92
 <2><53e>: Abbrev Number: 13 (DW_TAG_member)
    <53f>   DW_AT_name        : (indirect string, offset: 0xa11b4): _flags2
    <543>   DW_AT_decl_file   : 7
    <544>   DW_AT_decl_line   : 234
    <545>   DW_AT_decl_column : 9
    <546>   DW_AT_type        : <0x29>
    <54a>   DW_AT_data_member_location: 100
 <2><54b>: Abbrev Number: 0
 <1><54c>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <54d>   DW_AT_prototyped  : 1
    <54d>   DW_AT_type        : <0x29>
    <551>   DW_AT_sibling     : <0x56a>
 <2><555>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <556>   DW_AT_type        : <0x403>
 <2><55a>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <55b>   DW_AT_type        : <0xc3>
 <2><55f>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <560>   DW_AT_type        : <0x56a>
 <2><564>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <565>   DW_AT_type        : <0x29>
 <2><569>: Abbrev Number: 0
 <1><56a>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <56b>   DW_AT_byte_size   : 4
    <56c>   DW_AT_type        : <0x570>
 <1><570>: Abbrev Number: 3 (DW_TAG_base_type)
    <571>   DW_AT_byte_size   : 1
    <572>   DW_AT_encoding    : 8	(unsigned char)
    <573>   DW_AT_name        : (indirect string, offset: 0x3bf8e): char
 <1><577>: Abbrev Number: 5 (DW_TAG_const_type)
    <578>   DW_AT_type        : <0x570>
 <1><57c>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <57d>   DW_AT_byte_size   : 4
    <57e>   DW_AT_type        : <0x54c>
 <1><582>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <583>   DW_AT_prototyped  : 1
    <583>   DW_AT_type        : <0x29>
    <587>   DW_AT_sibling     : <0x5a0>
 <2><58b>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <58c>   DW_AT_type        : <0x403>
 <2><590>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <591>   DW_AT_type        : <0xc3>
 <2><595>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <596>   DW_AT_type        : <0x5a0>
 <2><59a>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <59b>   DW_AT_type        : <0x29>
 <2><59f>: Abbrev Number: 0
 <1><5a0>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <5a1>   DW_AT_byte_size   : 4
    <5a2>   DW_AT_type        : <0x577>
 <1><5a6>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <5a7>   DW_AT_byte_size   : 4
    <5a8>   DW_AT_type        : <0x582>
 <1><5ac>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <5ad>   DW_AT_prototyped  : 1
    <5ad>   DW_AT_type        : <0x102>
    <5b1>   DW_AT_sibling     : <0x5ca>
 <2><5b5>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <5b6>   DW_AT_type        : <0x403>
 <2><5ba>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <5bb>   DW_AT_type        : <0xc3>
 <2><5bf>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <5c0>   DW_AT_type        : <0x102>
 <2><5c4>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <5c5>   DW_AT_type        : <0x29>
 <2><5c9>: Abbrev Number: 0
 <1><5ca>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <5cb>   DW_AT_byte_size   : 4
    <5cc>   DW_AT_type        : <0x5ac>
 <1><5d0>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <5d1>   DW_AT_prototyped  : 1
    <5d1>   DW_AT_type        : <0x29>
    <5d5>   DW_AT_sibling     : <0x5e4>
 <2><5d9>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <5da>   DW_AT_type        : <0x403>
 <2><5de>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <5df>   DW_AT_type        : <0xc3>
 <2><5e3>: Abbrev Number: 0
 <1><5e4>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <5e5>   DW_AT_byte_size   : 4
    <5e6>   DW_AT_type        : <0x5d0>
 <1><5ea>: Abbrev Number: 10 (DW_TAG_array_type)
    <5eb>   DW_AT_type        : <0x58>
    <5ef>   DW_AT_sibling     : <0x5fa>
 <2><5f3>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <5f4>   DW_AT_type        : <0x30>
    <5f8>   DW_AT_upper_bound : 2
 <2><5f9>: Abbrev Number: 0
 <1><5fa>: Abbrev Number: 10 (DW_TAG_array_type)
    <5fb>   DW_AT_type        : <0x58>
    <5ff>   DW_AT_sibling     : <0x60a>
 <2><603>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <604>   DW_AT_type        : <0x30>
    <608>   DW_AT_upper_bound : 0
 <2><609>: Abbrev Number: 0
 <1><60a>: Abbrev Number: 7 (DW_TAG_typedef)
    <60b>   DW_AT_name        : (indirect string, offset: 0xa4c80): __FILE
    <60f>   DW_AT_decl_file   : 7
    <610>   DW_AT_decl_line   : 292
    <612>   DW_AT_decl_column : 26
    <613>   DW_AT_type        : <0x409>
 <1><617>: Abbrev Number: 18 (DW_TAG_structure_type)
    <618>   DW_AT_name        : (indirect string, offset: 0x9fe6b): _glue
    <61c>   DW_AT_byte_size   : 12
    <61d>   DW_AT_decl_file   : 7
    <61e>   DW_AT_decl_line   : 296
    <620>   DW_AT_decl_column : 8
    <621>   DW_AT_sibling     : <0x650>
 <2><625>: Abbrev Number: 19 (DW_TAG_member)
    <626>   DW_AT_name        : (indirect string, offset: 0x6f26d): _next
    <62a>   DW_AT_decl_file   : 7
    <62b>   DW_AT_decl_line   : 298
    <62d>   DW_AT_decl_column : 17
    <62e>   DW_AT_type        : <0x650>
    <632>   DW_AT_data_member_location: 0
 <2><633>: Abbrev Number: 19 (DW_TAG_member)
    <634>   DW_AT_name        : (indirect string, offset: 0x461ce): _niobs
    <638>   DW_AT_decl_file   : 7
    <639>   DW_AT_decl_line   : 299
    <63b>   DW_AT_decl_column : 7
    <63c>   DW_AT_type        : <0x29>
    <640>   DW_AT_data_member_location: 4
 <2><641>: Abbrev Number: 19 (DW_TAG_member)
    <642>   DW_AT_name        : (indirect string, offset: 0x5e44b): _iobs
    <646>   DW_AT_decl_file   : 7
    <647>   DW_AT_decl_line   : 300
    <649>   DW_AT_decl_column : 11
    <64a>   DW_AT_type        : <0x656>
    <64e>   DW_AT_data_member_location: 8
 <2><64f>: Abbrev Number: 0
 <1><650>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <651>   DW_AT_byte_size   : 4
    <652>   DW_AT_type        : <0x617>
 <1><656>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <657>   DW_AT_byte_size   : 4
    <658>   DW_AT_type        : <0x60a>
 <1><65c>: Abbrev Number: 18 (DW_TAG_structure_type)
    <65d>   DW_AT_name        : (indirect string, offset: 0x409dd): _rand48
    <661>   DW_AT_byte_size   : 24
    <662>   DW_AT_decl_file   : 7
    <663>   DW_AT_decl_line   : 324
    <665>   DW_AT_decl_column : 8
    <666>   DW_AT_sibling     : <0x6a3>
 <2><66a>: Abbrev Number: 19 (DW_TAG_member)
    <66b>   DW_AT_name        : (indirect string, offset: 0xb75fc): _seed
    <66f>   DW_AT_decl_file   : 7
    <670>   DW_AT_decl_line   : 325
    <672>   DW_AT_decl_column : 18
    <673>   DW_AT_type        : <0x6a3>
    <677>   DW_AT_data_member_location: 0
 <2><678>: Abbrev Number: 19 (DW_TAG_member)
    <679>   DW_AT_name        : (indirect string, offset: 0xf9f5): _mult
    <67d>   DW_AT_decl_file   : 7
    <67e>   DW_AT_decl_line   : 326
    <680>   DW_AT_decl_column : 18
    <681>   DW_AT_type        : <0x6a3>
    <685>   DW_AT_data_member_location: 6
 <2><686>: Abbrev Number: 19 (DW_TAG_member)
    <687>   DW_AT_name        : (indirect string, offset: 0x5ff66): _add
    <68b>   DW_AT_decl_file   : 7
    <68c>   DW_AT_decl_line   : 327
    <68e>   DW_AT_decl_column : 18
    <68f>   DW_AT_type        : <0x72>
    <693>   DW_AT_data_member_location: 12
 <2><694>: Abbrev Number: 19 (DW_TAG_member)
    <695>   DW_AT_name        : (indirect string, offset: 0x6f268): _rand_next
    <699>   DW_AT_decl_file   : 7
    <69a>   DW_AT_decl_line   : 330
    <69c>   DW_AT_decl_column : 36
    <69d>   DW_AT_type        : <0x93>
    <6a1>   DW_AT_data_member_location: 16
 <2><6a2>: Abbrev Number: 0
 <1><6a3>: Abbrev Number: 10 (DW_TAG_array_type)
    <6a4>   DW_AT_type        : <0x72>
    <6a8>   DW_AT_sibling     : <0x6b3>
 <2><6ac>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <6ad>   DW_AT_type        : <0x30>
    <6b1>   DW_AT_upper_bound : 2
 <2><6b2>: Abbrev Number: 0
 <1><6b3>: Abbrev Number: 18 (DW_TAG_structure_type)
    <6b4>   DW_AT_name        : (indirect string, offset: 0x8d8d3): _mprec
    <6b8>   DW_AT_byte_size   : 16
    <6b9>   DW_AT_decl_file   : 7
    <6ba>   DW_AT_decl_line   : 349
    <6bc>   DW_AT_decl_column : 8
    <6bd>   DW_AT_sibling     : <0x6fa>
 <2><6c1>: Abbrev Number: 19 (DW_TAG_member)
    <6c2>   DW_AT_name        : (indirect string, offset: 0xba9f0): _result
    <6c6>   DW_AT_decl_file   : 7
    <6c7>   DW_AT_decl_line   : 352
    <6c9>   DW_AT_decl_column : 19
    <6ca>   DW_AT_type        : <0x1f9>
    <6ce>   DW_AT_data_member_location: 0
 <2><6cf>: Abbrev Number: 19 (DW_TAG_member)
    <6d0>   DW_AT_name        : (indirect string, offset: 0x7a3e9): _result_k
    <6d4>   DW_AT_decl_file   : 7
    <6d5>   DW_AT_decl_line   : 353
    <6d7>   DW_AT_decl_column : 7
    <6d8>   DW_AT_type        : <0x29>
    <6dc>   DW_AT_data_member_location: 4
 <2><6dd>: Abbrev Number: 19 (DW_TAG_member)
    <6de>   DW_AT_name        : (indirect string, offset: 0x58bfa): _p5s
    <6e2>   DW_AT_decl_file   : 7
    <6e3>   DW_AT_decl_line   : 354
    <6e5>   DW_AT_decl_column : 19
    <6e6>   DW_AT_type        : <0x1f9>
    <6ea>   DW_AT_data_member_location: 8
 <2><6eb>: Abbrev Number: 19 (DW_TAG_member)
    <6ec>   DW_AT_name        : (indirect string, offset: 0x6bfd7): _freelist
    <6f0>   DW_AT_decl_file   : 7
    <6f1>   DW_AT_decl_line   : 355
    <6f3>   DW_AT_decl_column : 20
    <6f4>   DW_AT_type        : <0x6fa>
    <6f8>   DW_AT_data_member_location: 12
 <2><6f9>: Abbrev Number: 0
 <1><6fa>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <6fb>   DW_AT_byte_size   : 4
    <6fc>   DW_AT_type        : <0x1f9>
 <1><700>: Abbrev Number: 18 (DW_TAG_structure_type)
    <701>   DW_AT_name        : (indirect string, offset: 0x58bc2): _misc_reent
    <705>   DW_AT_byte_size   : 80
    <706>   DW_AT_decl_file   : 7
    <707>   DW_AT_decl_line   : 359
    <709>   DW_AT_decl_column : 8
    <70a>   DW_AT_sibling     : <0x7a9>
 <2><70e>: Abbrev Number: 19 (DW_TAG_member)
    <70f>   DW_AT_name        : (indirect string, offset: 0xaa80c): _strtok_last
    <713>   DW_AT_decl_file   : 7
    <714>   DW_AT_decl_line   : 362
    <716>   DW_AT_decl_column : 9
    <717>   DW_AT_type        : <0x56a>
    <71b>   DW_AT_data_member_location: 0
 <2><71c>: Abbrev Number: 19 (DW_TAG_member)
    <71d>   DW_AT_name        : (indirect string, offset: 0x510cc): _mblen_state
    <721>   DW_AT_decl_file   : 7
    <722>   DW_AT_decl_line   : 363
    <724>   DW_AT_decl_column : 14
    <725>   DW_AT_type        : <0x164>
    <729>   DW_AT_data_member_location: 4
 <2><72a>: Abbrev Number: 19 (DW_TAG_member)
    <72b>   DW_AT_name        : (indirect string, offset: 0x4954c): _wctomb_state
    <72f>   DW_AT_decl_file   : 7
    <730>   DW_AT_decl_line   : 364
    <732>   DW_AT_decl_column : 14
    <733>   DW_AT_type        : <0x164>
    <737>   DW_AT_data_member_location: 12
 <2><738>: Abbrev Number: 19 (DW_TAG_member)
    <739>   DW_AT_name        : (indirect string, offset: 0x9f262): _mbtowc_state
    <73d>   DW_AT_decl_file   : 7
    <73e>   DW_AT_decl_line   : 365
    <740>   DW_AT_decl_column : 14
    <741>   DW_AT_type        : <0x164>
    <745>   DW_AT_data_member_location: 20
 <2><746>: Abbrev Number: 19 (DW_TAG_member)
    <747>   DW_AT_name        : (indirect string, offset: 0xa4189): _l64a_buf
    <74b>   DW_AT_decl_file   : 7
    <74c>   DW_AT_decl_line   : 366
    <74e>   DW_AT_decl_column : 8
    <74f>   DW_AT_type        : <0x7a9>
    <753>   DW_AT_data_member_location: 28
 <2><754>: Abbrev Number: 19 (DW_TAG_member)
    <755>   DW_AT_name        : (indirect string, offset: 0xa9129): _getdate_err
    <759>   DW_AT_decl_file   : 7
    <75a>   DW_AT_decl_line   : 367
    <75c>   DW_AT_decl_column : 7
    <75d>   DW_AT_type        : <0x29>
    <761>   DW_AT_data_member_location: 36
 <2><762>: Abbrev Number: 19 (DW_TAG_member)
    <763>   DW_AT_name        : (indirect string, offset: 0x239ef): _mbrlen_state
    <767>   DW_AT_decl_file   : 7
    <768>   DW_AT_decl_line   : 368
    <76a>   DW_AT_decl_column : 14
    <76b>   DW_AT_type        : <0x164>
    <76f>   DW_AT_data_member_location: 40
 <2><770>: Abbrev Number: 19 (DW_TAG_member)
    <771>   DW_AT_name        : (indirect string, offset: 0xa95d1): _mbrtowc_state
    <775>   DW_AT_decl_file   : 7
    <776>   DW_AT_decl_line   : 369
    <778>   DW_AT_decl_column : 14
    <779>   DW_AT_type        : <0x164>
    <77d>   DW_AT_data_member_location: 48
 <2><77e>: Abbrev Number: 19 (DW_TAG_member)
    <77f>   DW_AT_name        : (indirect string, offset: 0x7b617): _mbsrtowcs_state
    <783>   DW_AT_decl_file   : 7
    <784>   DW_AT_decl_line   : 370
    <786>   DW_AT_decl_column : 14
    <787>   DW_AT_type        : <0x164>
    <78b>   DW_AT_data_member_location: 56
 <2><78c>: Abbrev Number: 19 (DW_TAG_member)
    <78d>   DW_AT_name        : (indirect string, offset: 0x397bf): _wcrtomb_state
    <791>   DW_AT_decl_file   : 7
    <792>   DW_AT_decl_line   : 371
    <794>   DW_AT_decl_column : 14
    <795>   DW_AT_type        : <0x164>
    <799>   DW_AT_data_member_location: 64
 <2><79a>: Abbrev Number: 19 (DW_TAG_member)
    <79b>   DW_AT_name        : (indirect string, offset: 0x6a681): _wcsrtombs_state
    <79f>   DW_AT_decl_file   : 7
    <7a0>   DW_AT_decl_line   : 372
    <7a2>   DW_AT_decl_column : 14
    <7a3>   DW_AT_type        : <0x164>
    <7a7>   DW_AT_data_member_location: 72
 <2><7a8>: Abbrev Number: 0
 <1><7a9>: Abbrev Number: 10 (DW_TAG_array_type)
    <7aa>   DW_AT_type        : <0x570>
    <7ae>   DW_AT_sibling     : <0x7b9>
 <2><7b2>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <7b3>   DW_AT_type        : <0x30>
    <7b7>   DW_AT_upper_bound : 7
 <2><7b8>: Abbrev Number: 0
 <1><7b9>: Abbrev Number: 15 (DW_TAG_structure_type)
    <7ba>   DW_AT_name        : (indirect string, offset: 0x9fe93): __locale_t
    <7be>   DW_AT_declaration : 1
 <1><7be>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <7bf>   DW_AT_byte_size   : 4
    <7c0>   DW_AT_type        : <0x7b9>
 <1><7c4>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <7c5>   DW_AT_byte_size   : 4
    <7c6>   DW_AT_type        : <0x6b3>
 <1><7ca>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <7cb>   DW_AT_prototyped  : 1
    <7cb>   DW_AT_sibling     : <0x7d5>
 <2><7cf>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <7d0>   DW_AT_type        : <0x403>
 <2><7d4>: Abbrev Number: 0
 <1><7d5>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <7d6>   DW_AT_byte_size   : 4
    <7d7>   DW_AT_type        : <0x7ca>
 <1><7db>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <7dc>   DW_AT_byte_size   : 4
    <7dd>   DW_AT_type        : <0x65c>
 <1><7e1>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <7e2>   DW_AT_byte_size   : 4
    <7e3>   DW_AT_type        : <0x20f>
 <1><7e7>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <7e8>   DW_AT_prototyped  : 1
    <7e8>   DW_AT_sibling     : <0x7f2>
 <2><7ec>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <7ed>   DW_AT_type        : <0x29>
 <2><7f1>: Abbrev Number: 0
 <1><7f2>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <7f3>   DW_AT_byte_size   : 4
    <7f4>   DW_AT_type        : <0x7f8>
 <1><7f8>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <7f9>   DW_AT_byte_size   : 4
    <7fa>   DW_AT_type        : <0x7e7>
 <1><7fe>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <7ff>   DW_AT_byte_size   : 4
    <800>   DW_AT_type        : <0x700>
 <1><804>: Abbrev Number: 18 (DW_TAG_structure_type)
    <805>   DW_AT_name        : (indirect string, offset: 0x9c102): xSTATIC_LIST_ITEM
    <809>   DW_AT_byte_size   : 20
    <80a>   DW_AT_decl_file   : 9
    <80b>   DW_AT_decl_line   : 1044
    <80d>   DW_AT_decl_column : 8
    <80e>   DW_AT_sibling     : <0x82f>
 <2><812>: Abbrev Number: 19 (DW_TAG_member)
    <813>   DW_AT_name        : (indirect string, offset: 0xbbe06): xDummy2
    <817>   DW_AT_decl_file   : 9
    <818>   DW_AT_decl_line   : 1049
    <81a>   DW_AT_decl_column : 13
    <81b>   DW_AT_type        : <0xdd>
    <81f>   DW_AT_data_member_location: 0
 <2><820>: Abbrev Number: 19 (DW_TAG_member)
    <821>   DW_AT_name        : (indirect string, offset: 0x27923): pvDummy3
    <825>   DW_AT_decl_file   : 9
    <826>   DW_AT_decl_line   : 1050
    <828>   DW_AT_decl_column : 8
    <829>   DW_AT_type        : <0x82f>
    <82d>   DW_AT_data_member_location: 4
 <2><82e>: Abbrev Number: 0
 <1><82f>: Abbrev Number: 10 (DW_TAG_array_type)
    <830>   DW_AT_type        : <0xc3>
    <834>   DW_AT_sibling     : <0x83f>
 <2><838>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <839>   DW_AT_type        : <0x30>
    <83d>   DW_AT_upper_bound : 3
 <2><83e>: Abbrev Number: 0
 <1><83f>: Abbrev Number: 7 (DW_TAG_typedef)
    <840>   DW_AT_name        : (indirect string, offset: 0x43b61): StaticListItem_t
    <844>   DW_AT_decl_file   : 9
    <845>   DW_AT_decl_line   : 1055
    <847>   DW_AT_decl_column : 34
    <848>   DW_AT_type        : <0x804>
 <1><84c>: Abbrev Number: 18 (DW_TAG_structure_type)
    <84d>   DW_AT_name        : (indirect string, offset: 0x7c473): xSTATIC_TCB
    <851>   DW_AT_byte_size   : 180
    <852>   DW_AT_decl_file   : 9
    <853>   DW_AT_decl_line   : 1095
    <855>   DW_AT_decl_column : 16
    <856>   DW_AT_sibling     : <0x8e7>
 <2><85a>: Abbrev Number: 19 (DW_TAG_member)
    <85b>   DW_AT_name        : (indirect string, offset: 0x26557): pxDummy1
    <85f>   DW_AT_decl_file   : 9
    <860>   DW_AT_decl_line   : 1097
    <862>   DW_AT_decl_column : 11
    <863>   DW_AT_type        : <0xc3>
    <867>   DW_AT_data_member_location: 0
 <2><868>: Abbrev Number: 19 (DW_TAG_member)
    <869>   DW_AT_name        : (indirect string, offset: 0x23bc5): xDummy3
    <86d>   DW_AT_decl_file   : 9
    <86e>   DW_AT_decl_line   : 1101
    <870>   DW_AT_decl_column : 19
    <871>   DW_AT_type        : <0x8e7>
    <875>   DW_AT_data_member_location: 4
 <2><876>: Abbrev Number: 19 (DW_TAG_member)
    <877>   DW_AT_name        : (indirect string, offset: 0x19a21): uxDummy5
    <87b>   DW_AT_decl_file   : 9
    <87c>   DW_AT_decl_line   : 1102
    <87e>   DW_AT_decl_column : 16
    <87f>   DW_AT_type        : <0xd1>
    <883>   DW_AT_data_member_location: 44
 <2><884>: Abbrev Number: 19 (DW_TAG_member)
    <885>   DW_AT_name        : (indirect string, offset: 0x2657a): pxDummy6
    <889>   DW_AT_decl_file   : 9
    <88a>   DW_AT_decl_line   : 1103
    <88c>   DW_AT_decl_column : 11
    <88d>   DW_AT_type        : <0xc3>
    <891>   DW_AT_data_member_location: 48
 <2><892>: Abbrev Number: 19 (DW_TAG_member)
    <893>   DW_AT_name        : (indirect string, offset: 0x41d71): ucDummy7
    <897>   DW_AT_decl_file   : 9
    <898>   DW_AT_decl_line   : 1104
    <89a>   DW_AT_decl_column : 13
    <89b>   DW_AT_type        : <0x8f7>
    <89f>   DW_AT_data_member_location: 52
 <2><8a0>: Abbrev Number: 19 (DW_TAG_member)
    <8a1>   DW_AT_name        : (indirect string, offset: 0xa84ba): uxDummy12
    <8a5>   DW_AT_decl_file   : 9
    <8a6>   DW_AT_decl_line   : 1115
    <8a8>   DW_AT_decl_column : 16
    <8a9>   DW_AT_type        : <0x907>
    <8ad>   DW_AT_data_member_location: 68
 <2><8ae>: Abbrev Number: 19 (DW_TAG_member)
    <8af>   DW_AT_name        : (indirect string, offset: 0x947cd): xDummy17
    <8b3>   DW_AT_decl_file   : 9
    <8b4>   DW_AT_decl_line   : 1127
    <8b6>   DW_AT_decl_column : 17
    <8b7>   DW_AT_type        : <0x2c0>
    <8bb>   DW_AT_data_member_location: 76
 <2><8bc>: Abbrev Number: 19 (DW_TAG_member)
    <8bd>   DW_AT_name        : (indirect string, offset: 0x1adb4): ulDummy18
    <8c1>   DW_AT_decl_file   : 9
    <8c2>   DW_AT_decl_line   : 1130
    <8c4>   DW_AT_decl_column : 14
    <8c5>   DW_AT_type        : <0xb7>
    <8c9>   DW_AT_data_member_location: 172
 <2><8ca>: Abbrev Number: 19 (DW_TAG_member)
    <8cb>   DW_AT_name        : (indirect string, offset: 0x38e9c): ucDummy19
    <8cf>   DW_AT_decl_file   : 9
    <8d0>   DW_AT_decl_line   : 1131
    <8d2>   DW_AT_decl_column : 13
    <8d3>   DW_AT_type        : <0x9a>
    <8d7>   DW_AT_data_member_location: 176
 <2><8d8>: Abbrev Number: 19 (DW_TAG_member)
    <8d9>   DW_AT_name        : (indirect string, offset: 0xa8a02): uxDummy20
    <8dd>   DW_AT_decl_file   : 9
    <8de>   DW_AT_decl_line   : 1134
    <8e0>   DW_AT_decl_column : 13
    <8e1>   DW_AT_type        : <0x9a>
    <8e5>   DW_AT_data_member_location: 177
 <2><8e6>: Abbrev Number: 0
 <1><8e7>: Abbrev Number: 10 (DW_TAG_array_type)
    <8e8>   DW_AT_type        : <0x83f>
    <8ec>   DW_AT_sibling     : <0x8f7>
 <2><8f0>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <8f1>   DW_AT_type        : <0x30>
    <8f5>   DW_AT_upper_bound : 1
 <2><8f6>: Abbrev Number: 0
 <1><8f7>: Abbrev Number: 10 (DW_TAG_array_type)
    <8f8>   DW_AT_type        : <0x9a>
    <8fc>   DW_AT_sibling     : <0x907>
 <2><900>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <901>   DW_AT_type        : <0x30>
    <905>   DW_AT_upper_bound : 15
 <2><906>: Abbrev Number: 0
 <1><907>: Abbrev Number: 10 (DW_TAG_array_type)
    <908>   DW_AT_type        : <0xd1>
    <90c>   DW_AT_sibling     : <0x917>
 <2><910>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <911>   DW_AT_type        : <0x30>
    <915>   DW_AT_upper_bound : 1
 <2><916>: Abbrev Number: 0
 <1><917>: Abbrev Number: 7 (DW_TAG_typedef)
    <918>   DW_AT_name        : (indirect string, offset: 0x5c423): StaticTask_t
    <91c>   DW_AT_decl_file   : 9
    <91d>   DW_AT_decl_line   : 1143
    <91f>   DW_AT_decl_column : 3
    <920>   DW_AT_type        : <0x84c>
 <1><924>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <925>   DW_AT_byte_size   : 4
    <926>   DW_AT_type        : <0xc5>
 <1><92a>: Abbrev Number: 10 (DW_TAG_array_type)
    <92b>   DW_AT_type        : <0xa6>
    <92f>   DW_AT_sibling     : <0x93a>
 <2><933>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <934>   DW_AT_type        : <0x30>
    <938>   DW_AT_upper_bound : 6
 <2><939>: Abbrev Number: 0
 <1><93a>: Abbrev Number: 5 (DW_TAG_const_type)
    <93b>   DW_AT_type        : <0x92a>
 <1><93f>: Abbrev Number: 24 (DW_TAG_variable)
    <940>   DW_AT_name        : (indirect string, offset: 0x9f024): CHANNEL_OFFSET_TAB
    <944>   DW_AT_decl_file   : 10
    <945>   DW_AT_decl_line   : 47
    <946>   DW_AT_decl_column : 22
    <947>   DW_AT_type        : <0x93a>
    <94b>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><951>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <952>   DW_AT_byte_size   : 4
    <953>   DW_AT_type        : <0xb7>
 <1><957>: Abbrev Number: 24 (DW_TAG_variable)
    <958>   DW_AT_name        : (indirect string, offset: 0x62d03): xIdleTaskTCBBuffer
    <95c>   DW_AT_decl_file   : 1
    <95d>   DW_AT_decl_line   : 80
    <95e>   DW_AT_decl_column : 21
    <95f>   DW_AT_type        : <0x917>
    <963>   DW_AT_location    : 5 byte block: 3 90 0 0 20 	(DW_OP_addr: 20000090)
 <1><969>: Abbrev Number: 10 (DW_TAG_array_type)
    <96a>   DW_AT_type        : <0xc5>
    <96e>   DW_AT_sibling     : <0x979>
 <2><972>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <973>   DW_AT_type        : <0x30>
    <977>   DW_AT_upper_bound : 127
 <2><978>: Abbrev Number: 0
 <1><979>: Abbrev Number: 24 (DW_TAG_variable)
    <97a>   DW_AT_name        : (indirect string, offset: 0x53bfb): xIdleStack
    <97e>   DW_AT_decl_file   : 1
    <97f>   DW_AT_decl_line   : 81
    <980>   DW_AT_decl_column : 20
    <981>   DW_AT_type        : <0x969>
    <985>   DW_AT_location    : 5 byte block: 3 44 1 0 20 	(DW_OP_addr: 20000144)
 <1><98b>: Abbrev Number: 24 (DW_TAG_variable)
    <98c>   DW_AT_name        : (indirect string, offset: 0x96787): xTimerTaskTCBBuffer
    <990>   DW_AT_decl_file   : 1
    <991>   DW_AT_decl_line   : 93
    <992>   DW_AT_decl_column : 21
    <993>   DW_AT_type        : <0x917>
    <997>   DW_AT_location    : 5 byte block: 3 44 3 0 20 	(DW_OP_addr: 20000344)
 <1><99d>: Abbrev Number: 10 (DW_TAG_array_type)
    <99e>   DW_AT_type        : <0xc5>
    <9a2>   DW_AT_sibling     : <0x9ad>
 <2><9a6>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <9a7>   DW_AT_type        : <0x30>
    <9ab>   DW_AT_upper_bound : 255
 <2><9ac>: Abbrev Number: 0
 <1><9ad>: Abbrev Number: 24 (DW_TAG_variable)
    <9ae>   DW_AT_name        : (indirect string, offset: 0xa3860): xTimerStack
    <9b2>   DW_AT_decl_file   : 1
    <9b3>   DW_AT_decl_line   : 94
    <9b4>   DW_AT_decl_column : 20
    <9b5>   DW_AT_type        : <0x99d>
    <9b9>   DW_AT_location    : 5 byte block: 3 f8 3 0 20 	(DW_OP_addr: 200003f8)
 <1><9bf>: Abbrev Number: 25 (DW_TAG_subprogram)
    <9c0>   DW_AT_external    : 1
    <9c0>   DW_AT_name        : (indirect string, offset: 0xa90ea): vApplicationGetTimerTaskMemory
    <9c4>   DW_AT_decl_file   : 1
    <9c5>   DW_AT_decl_line   : 96
    <9c6>   DW_AT_decl_column : 6
    <9c7>   DW_AT_prototyped  : 1
    <9c7>   DW_AT_low_pc      : 0x8000570
    <9cb>   DW_AT_high_pc     : 0x34
    <9cf>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9d1>   DW_AT_GNU_all_call_sites: 1
    <9d1>   DW_AT_sibling     : <0xa03>
 <2><9d5>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <9d6>   DW_AT_name        : (indirect string, offset: 0x96785): ppxTimerTaskTCBBuffer
    <9da>   DW_AT_decl_file   : 1
    <9db>   DW_AT_decl_line   : 96
    <9dc>   DW_AT_decl_column : 53
    <9dd>   DW_AT_type        : <0xa03>
    <9e1>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><9e4>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <9e5>   DW_AT_name        : (indirect string, offset: 0x1ea79): ppxTimerTaskStackBuffer
    <9e9>   DW_AT_decl_file   : 1
    <9ea>   DW_AT_decl_line   : 96
    <9eb>   DW_AT_decl_column : 90
    <9ec>   DW_AT_type        : <0xa0f>
    <9f0>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><9f3>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <9f4>   DW_AT_name        : (indirect string, offset: 0x44974): pulTimerTaskStackSize
    <9f8>   DW_AT_decl_file   : 1
    <9f9>   DW_AT_decl_line   : 96
    <9fa>   DW_AT_decl_column : 125
    <9fb>   DW_AT_type        : <0x951>
    <9ff>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><a02>: Abbrev Number: 0
 <1><a03>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <a04>   DW_AT_byte_size   : 4
    <a05>   DW_AT_type        : <0xa09>
 <1><a09>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <a0a>   DW_AT_byte_size   : 4
    <a0b>   DW_AT_type        : <0x917>
 <1><a0f>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <a10>   DW_AT_byte_size   : 4
    <a11>   DW_AT_type        : <0x924>
 <1><a15>: Abbrev Number: 25 (DW_TAG_subprogram)
    <a16>   DW_AT_external    : 1
    <a16>   DW_AT_name        : (indirect string, offset: 0x1359c): vApplicationGetIdleTaskMemory
    <a1a>   DW_AT_decl_file   : 1
    <a1b>   DW_AT_decl_line   : 83
    <a1c>   DW_AT_decl_column : 6
    <a1d>   DW_AT_prototyped  : 1
    <a1d>   DW_AT_low_pc      : 0x8000540
    <a21>   DW_AT_high_pc     : 0x30
    <a25>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a27>   DW_AT_GNU_all_call_sites: 1
    <a27>   DW_AT_sibling     : <0xa59>
 <2><a2b>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <a2c>   DW_AT_name        : (indirect string, offset: 0x62d01): ppxIdleTaskTCBBuffer
    <a30>   DW_AT_decl_file   : 1
    <a31>   DW_AT_decl_line   : 83
    <a32>   DW_AT_decl_column : 52
    <a33>   DW_AT_type        : <0xa03>
    <a37>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><a3a>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <a3b>   DW_AT_name        : (indirect string, offset: 0x6c3ad): ppxIdleTaskStackBuffer
    <a3f>   DW_AT_decl_file   : 1
    <a40>   DW_AT_decl_line   : 83
    <a41>   DW_AT_decl_column : 88
    <a42>   DW_AT_type        : <0xa0f>
    <a46>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><a49>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <a4a>   DW_AT_name        : (indirect string, offset: 0x7fc1f): pulIdleTaskStackSize
    <a4e>   DW_AT_decl_file   : 1
    <a4f>   DW_AT_decl_line   : 83
    <a50>   DW_AT_decl_column : 122
    <a51>   DW_AT_type        : <0x951>
    <a55>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><a58>: Abbrev Number: 0
 <1><a59>: Abbrev Number: 27 (DW_TAG_subprogram)
    <a5a>   DW_AT_external    : 1
    <a5a>   DW_AT_name        : (indirect string, offset: 0x7e217): vApplicationIdleHook
    <a5e>   DW_AT_decl_file   : 1
    <a5f>   DW_AT_decl_line   : 65
    <a60>   DW_AT_decl_column : 13
    <a61>   DW_AT_prototyped  : 1
    <a61>   DW_AT_low_pc      : 0x8000534
    <a65>   DW_AT_high_pc     : 0xc
    <a69>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a6b>   DW_AT_GNU_all_call_sites: 1
 <1><a6b>: Abbrev Number: 0
  Compilation Unit @ offset 0xa6c:
   Length:        0x32a1 (32-bit)
   Version:       4
   Abbrev Offset: 0x183
   Pointer Size:  4
 <0><a77>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <a78>   DW_AT_producer    : (indirect string, offset: 0x80382): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfloat-abi=soft -mthumb -march=armv7e-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <a7c>   DW_AT_language    : 12	(ANSI C99)
    <a7d>   DW_AT_name        : (indirect string, offset: 0xbd2f0): ../Core/Src/main.c
    <a81>   DW_AT_comp_dir    : (indirect string, offset: 0x3177f): C:/Users/adino/OneDrive/Documents/GitHub/flood-sensor/Debug
    <a85>   DW_AT_ranges      : 0x20
    <a89>   DW_AT_low_pc      : 0x0
    <a8d>   DW_AT_stmt_list   : 0xbda
    <a91>   DW_AT_GNU_macros  : 0x1b3c1
 <1><a95>: Abbrev Number: 2 (DW_TAG_base_type)
    <a96>   DW_AT_byte_size   : 1
    <a97>   DW_AT_encoding    : 6	(signed char)
    <a98>   DW_AT_name        : (indirect string, offset: 0x5d868): signed char
 <1><a9c>: Abbrev Number: 3 (DW_TAG_typedef)
    <a9d>   DW_AT_name        : (indirect string, offset: 0x3657a): __uint8_t
    <aa1>   DW_AT_decl_file   : 5
    <aa2>   DW_AT_decl_line   : 43
    <aa3>   DW_AT_decl_column : 24
    <aa4>   DW_AT_type        : <0xaa8>
 <1><aa8>: Abbrev Number: 2 (DW_TAG_base_type)
    <aa9>   DW_AT_byte_size   : 1
    <aaa>   DW_AT_encoding    : 8	(unsigned char)
    <aab>   DW_AT_name        : (indirect string, offset: 0x264fc): unsigned char
 <1><aaf>: Abbrev Number: 2 (DW_TAG_base_type)
    <ab0>   DW_AT_byte_size   : 2
    <ab1>   DW_AT_encoding    : 5	(signed)
    <ab2>   DW_AT_name        : (indirect string, offset: 0x8a25f): short int
 <1><ab6>: Abbrev Number: 3 (DW_TAG_typedef)
    <ab7>   DW_AT_name        : (indirect string, offset: 0x981df): __uint16_t
    <abb>   DW_AT_decl_file   : 5
    <abc>   DW_AT_decl_line   : 57
    <abd>   DW_AT_decl_column : 25
    <abe>   DW_AT_type        : <0xac2>
 <1><ac2>: Abbrev Number: 2 (DW_TAG_base_type)
    <ac3>   DW_AT_byte_size   : 2
    <ac4>   DW_AT_encoding    : 7	(unsigned)
    <ac5>   DW_AT_name        : (indirect string, offset: 0xb3001): short unsigned int
 <1><ac9>: Abbrev Number: 2 (DW_TAG_base_type)
    <aca>   DW_AT_byte_size   : 4
    <acb>   DW_AT_encoding    : 5	(signed)
    <acc>   DW_AT_name        : (indirect string, offset: 0xfc4c): long int
 <1><ad0>: Abbrev Number: 3 (DW_TAG_typedef)
    <ad1>   DW_AT_name        : (indirect string, offset: 0x767bb): __uint32_t
    <ad5>   DW_AT_decl_file   : 5
    <ad6>   DW_AT_decl_line   : 79
    <ad7>   DW_AT_decl_column : 25
    <ad8>   DW_AT_type        : <0xadc>
 <1><adc>: Abbrev Number: 2 (DW_TAG_base_type)
    <add>   DW_AT_byte_size   : 4
    <ade>   DW_AT_encoding    : 7	(unsigned)
    <adf>   DW_AT_name        : (indirect string, offset: 0x2cc1d): long unsigned int
 <1><ae3>: Abbrev Number: 2 (DW_TAG_base_type)
    <ae4>   DW_AT_byte_size   : 8
    <ae5>   DW_AT_encoding    : 5	(signed)
    <ae6>   DW_AT_name        : (indirect string, offset: 0x55174): long long int
 <1><aea>: Abbrev Number: 2 (DW_TAG_base_type)
    <aeb>   DW_AT_byte_size   : 8
    <aec>   DW_AT_encoding    : 7	(unsigned)
    <aed>   DW_AT_name        : (indirect string, offset: 0xa53f1): long long unsigned int
 <1><af1>: Abbrev Number: 4 (DW_TAG_base_type)
    <af2>   DW_AT_byte_size   : 4
    <af3>   DW_AT_encoding    : 5	(signed)
    <af4>   DW_AT_name        : int
 <1><af8>: Abbrev Number: 2 (DW_TAG_base_type)
    <af9>   DW_AT_byte_size   : 4
    <afa>   DW_AT_encoding    : 7	(unsigned)
    <afb>   DW_AT_name        : (indirect string, offset: 0xf549): unsigned int
 <1><aff>: Abbrev Number: 3 (DW_TAG_typedef)
    <b00>   DW_AT_name        : (indirect string, offset: 0x3657c): uint8_t
    <b04>   DW_AT_decl_file   : 6
    <b05>   DW_AT_decl_line   : 24
    <b06>   DW_AT_decl_column : 19
    <b07>   DW_AT_type        : <0xa9c>
 <1><b0b>: Abbrev Number: 5 (DW_TAG_const_type)
    <b0c>   DW_AT_type        : <0xaff>
 <1><b10>: Abbrev Number: 3 (DW_TAG_typedef)
    <b11>   DW_AT_name        : (indirect string, offset: 0x87a38): uint16_t
    <b15>   DW_AT_decl_file   : 6
    <b16>   DW_AT_decl_line   : 36
    <b17>   DW_AT_decl_column : 20
    <b18>   DW_AT_type        : <0xab6>
 <1><b1c>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <b1d>   DW_AT_type        : <0xb10>
 <1><b21>: Abbrev Number: 3 (DW_TAG_typedef)
    <b22>   DW_AT_name        : (indirect string, offset: 0x870a6): uint32_t
    <b26>   DW_AT_decl_file   : 6
    <b27>   DW_AT_decl_line   : 48
    <b28>   DW_AT_decl_column : 20
    <b29>   DW_AT_type        : <0xad0>
 <1><b2d>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <b2e>   DW_AT_type        : <0xb21>
 <1><b32>: Abbrev Number: 7 (DW_TAG_array_type)
    <b33>   DW_AT_type        : <0xb21>
    <b37>   DW_AT_sibling     : <0xb42>
 <2><b3b>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <b3c>   DW_AT_type        : <0xaf8>
    <b40>   DW_AT_upper_bound : 7
 <2><b41>: Abbrev Number: 0
 <1><b42>: Abbrev Number: 9 (DW_TAG_structure_type)
    <b43>   DW_AT_byte_size   : 184
    <b44>   DW_AT_decl_file   : 7
    <b45>   DW_AT_decl_line   : 165
    <b46>   DW_AT_decl_column : 9
    <b47>   DW_AT_sibling     : <0xc41>
 <2><b4b>: Abbrev Number: 10 (DW_TAG_member)
    <b4c>   DW_AT_name        : ISR
    <b50>   DW_AT_decl_file   : 7
    <b51>   DW_AT_decl_line   : 167
    <b52>   DW_AT_decl_column : 17
    <b53>   DW_AT_type        : <0xb2d>
    <b57>   DW_AT_data_member_location: 0
 <2><b58>: Abbrev Number: 10 (DW_TAG_member)
    <b59>   DW_AT_name        : IER
    <b5d>   DW_AT_decl_file   : 7
    <b5e>   DW_AT_decl_line   : 168
    <b5f>   DW_AT_decl_column : 17
    <b60>   DW_AT_type        : <0xb2d>
    <b64>   DW_AT_data_member_location: 4
 <2><b65>: Abbrev Number: 10 (DW_TAG_member)
    <b66>   DW_AT_name        : CR
    <b69>   DW_AT_decl_file   : 7
    <b6a>   DW_AT_decl_line   : 169
    <b6b>   DW_AT_decl_column : 17
    <b6c>   DW_AT_type        : <0xb2d>
    <b70>   DW_AT_data_member_location: 8
 <2><b71>: Abbrev Number: 11 (DW_TAG_member)
    <b72>   DW_AT_name        : (indirect string, offset: 0xc01ac): CFGR1
    <b76>   DW_AT_decl_file   : 7
    <b77>   DW_AT_decl_line   : 170
    <b78>   DW_AT_decl_column : 17
    <b79>   DW_AT_type        : <0xb2d>
    <b7d>   DW_AT_data_member_location: 12
 <2><b7e>: Abbrev Number: 11 (DW_TAG_member)
    <b7f>   DW_AT_name        : (indirect string, offset: 0xc01b5): CFGR2
    <b83>   DW_AT_decl_file   : 7
    <b84>   DW_AT_decl_line   : 171
    <b85>   DW_AT_decl_column : 17
    <b86>   DW_AT_type        : <0xb2d>
    <b8a>   DW_AT_data_member_location: 16
 <2><b8b>: Abbrev Number: 11 (DW_TAG_member)
    <b8c>   DW_AT_name        : (indirect string, offset: 0xbc88c): SMPR
    <b90>   DW_AT_decl_file   : 7
    <b91>   DW_AT_decl_line   : 172
    <b92>   DW_AT_decl_column : 17
    <b93>   DW_AT_type        : <0xb2d>
    <b97>   DW_AT_data_member_location: 20
 <2><b98>: Abbrev Number: 11 (DW_TAG_member)
    <b99>   DW_AT_name        : (indirect string, offset: 0xbd467): RESERVED1
    <b9d>   DW_AT_decl_file   : 7
    <b9e>   DW_AT_decl_line   : 173
    <b9f>   DW_AT_decl_column : 17
    <ba0>   DW_AT_type        : <0xb21>
    <ba4>   DW_AT_data_member_location: 24
 <2><ba5>: Abbrev Number: 11 (DW_TAG_member)
    <ba6>   DW_AT_name        : (indirect string, offset: 0xbd471): RESERVED2
    <baa>   DW_AT_decl_file   : 7
    <bab>   DW_AT_decl_line   : 174
    <bac>   DW_AT_decl_column : 17
    <bad>   DW_AT_type        : <0xb21>
    <bb1>   DW_AT_data_member_location: 28
 <2><bb2>: Abbrev Number: 11 (DW_TAG_member)
    <bb3>   DW_AT_name        : (indirect string, offset: 0x5b7fb): AWD1TR
    <bb7>   DW_AT_decl_file   : 7
    <bb8>   DW_AT_decl_line   : 175
    <bb9>   DW_AT_decl_column : 17
    <bba>   DW_AT_type        : <0xb2d>
    <bbe>   DW_AT_data_member_location: 32
 <2><bbf>: Abbrev Number: 11 (DW_TAG_member)
    <bc0>   DW_AT_name        : (indirect string, offset: 0x524ee): AWD2TR
    <bc4>   DW_AT_decl_file   : 7
    <bc5>   DW_AT_decl_line   : 176
    <bc6>   DW_AT_decl_column : 17
    <bc7>   DW_AT_type        : <0xb2d>
    <bcb>   DW_AT_data_member_location: 36
 <2><bcc>: Abbrev Number: 11 (DW_TAG_member)
    <bcd>   DW_AT_name        : (indirect string, offset: 0xbbc82): CHSELR
    <bd1>   DW_AT_decl_file   : 7
    <bd2>   DW_AT_decl_line   : 177
    <bd3>   DW_AT_decl_column : 17
    <bd4>   DW_AT_type        : <0xb2d>
    <bd8>   DW_AT_data_member_location: 40
 <2><bd9>: Abbrev Number: 11 (DW_TAG_member)
    <bda>   DW_AT_name        : (indirect string, offset: 0x893c4): AWD3TR
    <bde>   DW_AT_decl_file   : 7
    <bdf>   DW_AT_decl_line   : 178
    <be0>   DW_AT_decl_column : 17
    <be1>   DW_AT_type        : <0xb2d>
    <be5>   DW_AT_data_member_location: 44
 <2><be6>: Abbrev Number: 11 (DW_TAG_member)
    <be7>   DW_AT_name        : (indirect string, offset: 0xbd47b): RESERVED3
    <beb>   DW_AT_decl_file   : 7
    <bec>   DW_AT_decl_line   : 179
    <bed>   DW_AT_decl_column : 17
    <bee>   DW_AT_type        : <0xc41>
    <bf2>   DW_AT_data_member_location: 48
 <2><bf3>: Abbrev Number: 10 (DW_TAG_member)
    <bf4>   DW_AT_name        : DR
    <bf7>   DW_AT_decl_file   : 7
    <bf8>   DW_AT_decl_line   : 180
    <bf9>   DW_AT_decl_column : 17
    <bfa>   DW_AT_type        : <0xb2d>
    <bfe>   DW_AT_data_member_location: 64
 <2><bff>: Abbrev Number: 11 (DW_TAG_member)
    <c00>   DW_AT_name        : (indirect string, offset: 0xbcaed): RESERVED4
    <c04>   DW_AT_decl_file   : 7
    <c05>   DW_AT_decl_line   : 181
    <c06>   DW_AT_decl_column : 17
    <c07>   DW_AT_type        : <0xc51>
    <c0b>   DW_AT_data_member_location: 68
 <2><c0c>: Abbrev Number: 11 (DW_TAG_member)
    <c0d>   DW_AT_name        : (indirect string, offset: 0xbcbe7): AWD2CR
    <c11>   DW_AT_decl_file   : 7
    <c12>   DW_AT_decl_line   : 182
    <c13>   DW_AT_decl_column : 17
    <c14>   DW_AT_type        : <0xb2d>
    <c18>   DW_AT_data_member_location: 160
 <2><c19>: Abbrev Number: 11 (DW_TAG_member)
    <c1a>   DW_AT_name        : (indirect string, offset: 0xbcf83): AWD3CR
    <c1e>   DW_AT_decl_file   : 7
    <c1f>   DW_AT_decl_line   : 183
    <c20>   DW_AT_decl_column : 17
    <c21>   DW_AT_type        : <0xb2d>
    <c25>   DW_AT_data_member_location: 164
 <2><c26>: Abbrev Number: 11 (DW_TAG_member)
    <c27>   DW_AT_name        : (indirect string, offset: 0xbd485): RESERVED5
    <c2b>   DW_AT_decl_file   : 7
    <c2c>   DW_AT_decl_line   : 184
    <c2d>   DW_AT_decl_column : 17
    <c2e>   DW_AT_type        : <0xc61>
    <c32>   DW_AT_data_member_location: 168
 <2><c33>: Abbrev Number: 11 (DW_TAG_member)
    <c34>   DW_AT_name        : (indirect string, offset: 0xbc369): CALFACT
    <c38>   DW_AT_decl_file   : 7
    <c39>   DW_AT_decl_line   : 185
    <c3a>   DW_AT_decl_column : 17
    <c3b>   DW_AT_type        : <0xb2d>
    <c3f>   DW_AT_data_member_location: 180
 <2><c40>: Abbrev Number: 0
 <1><c41>: Abbrev Number: 7 (DW_TAG_array_type)
    <c42>   DW_AT_type        : <0xb21>
    <c46>   DW_AT_sibling     : <0xc51>
 <2><c4a>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <c4b>   DW_AT_type        : <0xaf8>
    <c4f>   DW_AT_upper_bound : 3
 <2><c50>: Abbrev Number: 0
 <1><c51>: Abbrev Number: 7 (DW_TAG_array_type)
    <c52>   DW_AT_type        : <0xb21>
    <c56>   DW_AT_sibling     : <0xc61>
 <2><c5a>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <c5b>   DW_AT_type        : <0xaf8>
    <c5f>   DW_AT_upper_bound : 22
 <2><c60>: Abbrev Number: 0
 <1><c61>: Abbrev Number: 7 (DW_TAG_array_type)
    <c62>   DW_AT_type        : <0xb21>
    <c66>   DW_AT_sibling     : <0xc71>
 <2><c6a>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <c6b>   DW_AT_type        : <0xaf8>
    <c6f>   DW_AT_upper_bound : 2
 <2><c70>: Abbrev Number: 0
 <1><c71>: Abbrev Number: 3 (DW_TAG_typedef)
    <c72>   DW_AT_name        : (indirect string, offset: 0xbcf56): ADC_TypeDef
    <c76>   DW_AT_decl_file   : 7
    <c77>   DW_AT_decl_line   : 186
    <c78>   DW_AT_decl_column : 3
    <c79>   DW_AT_type        : <0xb42>
 <1><c7d>: Abbrev Number: 12 (DW_TAG_structure_type)
    <c7e>   DW_AT_byte_size   : 16
    <c7f>   DW_AT_decl_file   : 7
    <c80>   DW_AT_decl_line   : 300
    <c82>   DW_AT_decl_column : 9
    <c83>   DW_AT_sibling     : <0xcc0>
 <2><c87>: Abbrev Number: 13 (DW_TAG_member)
    <c88>   DW_AT_name        : CCR
    <c8c>   DW_AT_decl_file   : 7
    <c8d>   DW_AT_decl_line   : 302
    <c8f>   DW_AT_decl_column : 17
    <c90>   DW_AT_type        : <0xb2d>
    <c94>   DW_AT_data_member_location: 0
 <2><c95>: Abbrev Number: 14 (DW_TAG_member)
    <c96>   DW_AT_name        : (indirect string, offset: 0xbcc83): CNDTR
    <c9a>   DW_AT_decl_file   : 7
    <c9b>   DW_AT_decl_line   : 303
    <c9d>   DW_AT_decl_column : 17
    <c9e>   DW_AT_type        : <0xb2d>
    <ca2>   DW_AT_data_member_location: 4
 <2><ca3>: Abbrev Number: 14 (DW_TAG_member)
    <ca4>   DW_AT_name        : (indirect string, offset: 0xbd3c7): CPAR
    <ca8>   DW_AT_decl_file   : 7
    <ca9>   DW_AT_decl_line   : 304
    <cab>   DW_AT_decl_column : 17
    <cac>   DW_AT_type        : <0xb2d>
    <cb0>   DW_AT_data_member_location: 8
 <2><cb1>: Abbrev Number: 14 (DW_TAG_member)
    <cb2>   DW_AT_name        : (indirect string, offset: 0xbc98e): CMAR
    <cb6>   DW_AT_decl_file   : 7
    <cb7>   DW_AT_decl_line   : 305
    <cb9>   DW_AT_decl_column : 17
    <cba>   DW_AT_type        : <0xb2d>
    <cbe>   DW_AT_data_member_location: 12
 <2><cbf>: Abbrev Number: 0
 <1><cc0>: Abbrev Number: 15 (DW_TAG_typedef)
    <cc1>   DW_AT_name        : (indirect string, offset: 0xbd084): DMA_Channel_TypeDef
    <cc5>   DW_AT_decl_file   : 7
    <cc6>   DW_AT_decl_line   : 306
    <cc8>   DW_AT_decl_column : 3
    <cc9>   DW_AT_type        : <0xc7d>
 <1><ccd>: Abbrev Number: 12 (DW_TAG_structure_type)
    <cce>   DW_AT_byte_size   : 8
    <ccf>   DW_AT_decl_file   : 7
    <cd0>   DW_AT_decl_line   : 308
    <cd2>   DW_AT_decl_column : 9
    <cd3>   DW_AT_sibling     : <0xcf4>
 <2><cd7>: Abbrev Number: 13 (DW_TAG_member)
    <cd8>   DW_AT_name        : ISR
    <cdc>   DW_AT_decl_file   : 7
    <cdd>   DW_AT_decl_line   : 310
    <cdf>   DW_AT_decl_column : 17
    <ce0>   DW_AT_type        : <0xb2d>
    <ce4>   DW_AT_data_member_location: 0
 <2><ce5>: Abbrev Number: 14 (DW_TAG_member)
    <ce6>   DW_AT_name        : (indirect string, offset: 0xbce07): IFCR
    <cea>   DW_AT_decl_file   : 7
    <ceb>   DW_AT_decl_line   : 311
    <ced>   DW_AT_decl_column : 17
    <cee>   DW_AT_type        : <0xb2d>
    <cf2>   DW_AT_data_member_location: 4
 <2><cf3>: Abbrev Number: 0
 <1><cf4>: Abbrev Number: 15 (DW_TAG_typedef)
    <cf5>   DW_AT_name        : (indirect string, offset: 0xbc432): DMA_TypeDef
    <cf9>   DW_AT_decl_file   : 7
    <cfa>   DW_AT_decl_line   : 312
    <cfc>   DW_AT_decl_column : 3
    <cfd>   DW_AT_type        : <0xccd>
 <1><d01>: Abbrev Number: 12 (DW_TAG_structure_type)
    <d02>   DW_AT_byte_size   : 4
    <d03>   DW_AT_decl_file   : 7
    <d04>   DW_AT_decl_line   : 317
    <d06>   DW_AT_decl_column : 9
    <d07>   DW_AT_sibling     : <0xd1a>
 <2><d0b>: Abbrev Number: 13 (DW_TAG_member)
    <d0c>   DW_AT_name        : CCR
    <d10>   DW_AT_decl_file   : 7
    <d11>   DW_AT_decl_line   : 319
    <d13>   DW_AT_decl_column : 19
    <d14>   DW_AT_type        : <0xb2d>
    <d18>   DW_AT_data_member_location: 0
 <2><d19>: Abbrev Number: 0
 <1><d1a>: Abbrev Number: 15 (DW_TAG_typedef)
    <d1b>   DW_AT_name        : (indirect string, offset: 0xbbd35): DMAMUX_Channel_TypeDef
    <d1f>   DW_AT_decl_file   : 7
    <d20>   DW_AT_decl_line   : 320
    <d22>   DW_AT_decl_column : 2
    <d23>   DW_AT_type        : <0xd01>
 <1><d27>: Abbrev Number: 12 (DW_TAG_structure_type)
    <d28>   DW_AT_byte_size   : 8
    <d29>   DW_AT_decl_file   : 7
    <d2a>   DW_AT_decl_line   : 322
    <d2c>   DW_AT_decl_column : 9
    <d2d>   DW_AT_sibling     : <0xd4e>
 <2><d31>: Abbrev Number: 13 (DW_TAG_member)
    <d32>   DW_AT_name        : CSR
    <d36>   DW_AT_decl_file   : 7
    <d37>   DW_AT_decl_line   : 324
    <d39>   DW_AT_decl_column : 19
    <d3a>   DW_AT_type        : <0xb2d>
    <d3e>   DW_AT_data_member_location: 0
 <2><d3f>: Abbrev Number: 13 (DW_TAG_member)
    <d40>   DW_AT_name        : CFR
    <d44>   DW_AT_decl_file   : 7
    <d45>   DW_AT_decl_line   : 325
    <d47>   DW_AT_decl_column : 19
    <d48>   DW_AT_type        : <0xb2d>
    <d4c>   DW_AT_data_member_location: 4
 <2><d4d>: Abbrev Number: 0
 <1><d4e>: Abbrev Number: 15 (DW_TAG_typedef)
    <d4f>   DW_AT_name        : (indirect string, offset: 0xbd4ab): DMAMUX_ChannelStatus_TypeDef
    <d53>   DW_AT_decl_file   : 7
    <d54>   DW_AT_decl_line   : 326
    <d56>   DW_AT_decl_column : 2
    <d57>   DW_AT_type        : <0xd27>
 <1><d5b>: Abbrev Number: 12 (DW_TAG_structure_type)
    <d5c>   DW_AT_byte_size   : 4
    <d5d>   DW_AT_decl_file   : 7
    <d5e>   DW_AT_decl_line   : 328
    <d60>   DW_AT_decl_column : 9
    <d61>   DW_AT_sibling     : <0xd74>
 <2><d65>: Abbrev Number: 14 (DW_TAG_member)
    <d66>   DW_AT_name        : (indirect string, offset: 0xbc7e1): RGCR
    <d6a>   DW_AT_decl_file   : 7
    <d6b>   DW_AT_decl_line   : 330
    <d6d>   DW_AT_decl_column : 19
    <d6e>   DW_AT_type        : <0xb2d>
    <d72>   DW_AT_data_member_location: 0
 <2><d73>: Abbrev Number: 0
 <1><d74>: Abbrev Number: 15 (DW_TAG_typedef)
    <d75>   DW_AT_name        : (indirect string, offset: 0xbcac2): DMAMUX_RequestGen_TypeDef
    <d79>   DW_AT_decl_file   : 7
    <d7a>   DW_AT_decl_line   : 331
    <d7c>   DW_AT_decl_column : 2
    <d7d>   DW_AT_type        : <0xd5b>
 <1><d81>: Abbrev Number: 12 (DW_TAG_structure_type)
    <d82>   DW_AT_byte_size   : 8
    <d83>   DW_AT_decl_file   : 7
    <d84>   DW_AT_decl_line   : 333
    <d86>   DW_AT_decl_column : 9
    <d87>   DW_AT_sibling     : <0xda8>
 <2><d8b>: Abbrev Number: 14 (DW_TAG_member)
    <d8c>   DW_AT_name        : (indirect string, offset: 0xbc887): RGSR
    <d90>   DW_AT_decl_file   : 7
    <d91>   DW_AT_decl_line   : 335
    <d93>   DW_AT_decl_column : 19
    <d94>   DW_AT_type        : <0xb2d>
    <d98>   DW_AT_data_member_location: 0
 <2><d99>: Abbrev Number: 14 (DW_TAG_member)
    <d9a>   DW_AT_name        : (indirect string, offset: 0xbbb01): RGCFR
    <d9e>   DW_AT_decl_file   : 7
    <d9f>   DW_AT_decl_line   : 336
    <da1>   DW_AT_decl_column : 19
    <da2>   DW_AT_type        : <0xb2d>
    <da6>   DW_AT_data_member_location: 4
 <2><da7>: Abbrev Number: 0
 <1><da8>: Abbrev Number: 15 (DW_TAG_typedef)
    <da9>   DW_AT_name        : (indirect string, offset: 0xbc000): DMAMUX_RequestGenStatus_TypeDef
    <dad>   DW_AT_decl_file   : 7
    <dae>   DW_AT_decl_line   : 337
    <db0>   DW_AT_decl_column : 2
    <db1>   DW_AT_type        : <0xd81>
 <1><db5>: Abbrev Number: 7 (DW_TAG_array_type)
    <db6>   DW_AT_type        : <0xb2d>
    <dba>   DW_AT_sibling     : <0xdc5>
 <2><dbe>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <dbf>   DW_AT_type        : <0xaf8>
    <dc3>   DW_AT_upper_bound : 1
 <2><dc4>: Abbrev Number: 0
 <1><dc5>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <dc6>   DW_AT_type        : <0xdb5>
 <1><dca>: Abbrev Number: 12 (DW_TAG_structure_type)
    <dcb>   DW_AT_byte_size   : 44
    <dcc>   DW_AT_decl_file   : 7
    <dcd>   DW_AT_decl_line   : 388
    <dcf>   DW_AT_decl_column : 9
    <dd0>   DW_AT_sibling     : <0xe61>
 <2><dd4>: Abbrev Number: 14 (DW_TAG_member)
    <dd5>   DW_AT_name        : (indirect string, offset: 0xbbb1e): MODER
    <dd9>   DW_AT_decl_file   : 7
    <dda>   DW_AT_decl_line   : 390
    <ddc>   DW_AT_decl_column : 17
    <ddd>   DW_AT_type        : <0xb2d>
    <de1>   DW_AT_data_member_location: 0
 <2><de2>: Abbrev Number: 14 (DW_TAG_member)
    <de3>   DW_AT_name        : (indirect string, offset: 0xbcf9e): OTYPER
    <de7>   DW_AT_decl_file   : 7
    <de8>   DW_AT_decl_line   : 391
    <dea>   DW_AT_decl_column : 17
    <deb>   DW_AT_type        : <0xb2d>
    <def>   DW_AT_data_member_location: 4
 <2><df0>: Abbrev Number: 14 (DW_TAG_member)
    <df1>   DW_AT_name        : (indirect string, offset: 0xbd28a): OSPEEDR
    <df5>   DW_AT_decl_file   : 7
    <df6>   DW_AT_decl_line   : 392
    <df8>   DW_AT_decl_column : 17
    <df9>   DW_AT_type        : <0xb2d>
    <dfd>   DW_AT_data_member_location: 8
 <2><dfe>: Abbrev Number: 14 (DW_TAG_member)
    <dff>   DW_AT_name        : (indirect string, offset: 0xbce30): PUPDR
    <e03>   DW_AT_decl_file   : 7
    <e04>   DW_AT_decl_line   : 393
    <e06>   DW_AT_decl_column : 17
    <e07>   DW_AT_type        : <0xb2d>
    <e0b>   DW_AT_data_member_location: 12
 <2><e0c>: Abbrev Number: 13 (DW_TAG_member)
    <e0d>   DW_AT_name        : IDR
    <e11>   DW_AT_decl_file   : 7
    <e12>   DW_AT_decl_line   : 394
    <e14>   DW_AT_decl_column : 17
    <e15>   DW_AT_type        : <0xb2d>
    <e19>   DW_AT_data_member_location: 16
 <2><e1a>: Abbrev Number: 13 (DW_TAG_member)
    <e1b>   DW_AT_name        : ODR
    <e1f>   DW_AT_decl_file   : 7
    <e20>   DW_AT_decl_line   : 395
    <e22>   DW_AT_decl_column : 17
    <e23>   DW_AT_type        : <0xb2d>
    <e27>   DW_AT_data_member_location: 20
 <2><e28>: Abbrev Number: 14 (DW_TAG_member)
    <e29>   DW_AT_name        : (indirect string, offset: 0xbc0ac): BSRR
    <e2d>   DW_AT_decl_file   : 7
    <e2e>   DW_AT_decl_line   : 396
    <e30>   DW_AT_decl_column : 17
    <e31>   DW_AT_type        : <0xb2d>
    <e35>   DW_AT_data_member_location: 24
 <2><e36>: Abbrev Number: 14 (DW_TAG_member)
    <e37>   DW_AT_name        : (indirect string, offset: 0xbd248): LCKR
    <e3b>   DW_AT_decl_file   : 7
    <e3c>   DW_AT_decl_line   : 397
    <e3e>   DW_AT_decl_column : 17
    <e3f>   DW_AT_type        : <0xb2d>
    <e43>   DW_AT_data_member_location: 28
 <2><e44>: Abbrev Number: 13 (DW_TAG_member)
    <e45>   DW_AT_name        : AFR
    <e49>   DW_AT_decl_file   : 7
    <e4a>   DW_AT_decl_line   : 398
    <e4c>   DW_AT_decl_column : 17
    <e4d>   DW_AT_type        : <0xdc5>
    <e51>   DW_AT_data_member_location: 32
 <2><e52>: Abbrev Number: 13 (DW_TAG_member)
    <e53>   DW_AT_name        : BRR
    <e57>   DW_AT_decl_file   : 7
    <e58>   DW_AT_decl_line   : 399
    <e5a>   DW_AT_decl_column : 17
    <e5b>   DW_AT_type        : <0xb2d>
    <e5f>   DW_AT_data_member_location: 40
 <2><e60>: Abbrev Number: 0
 <1><e61>: Abbrev Number: 15 (DW_TAG_typedef)
    <e62>   DW_AT_name        : (indirect string, offset: 0xbd549): GPIO_TypeDef
    <e66>   DW_AT_decl_file   : 7
    <e67>   DW_AT_decl_line   : 400
    <e69>   DW_AT_decl_column : 3
    <e6a>   DW_AT_type        : <0xdca>
 <1><e6e>: Abbrev Number: 12 (DW_TAG_structure_type)
    <e6f>   DW_AT_byte_size   : 44
    <e70>   DW_AT_decl_file   : 7
    <e71>   DW_AT_decl_line   : 431
    <e73>   DW_AT_decl_column : 9
    <e74>   DW_AT_sibling     : <0xf13>
 <2><e78>: Abbrev Number: 13 (DW_TAG_member)
    <e79>   DW_AT_name        : CR1
    <e7d>   DW_AT_decl_file   : 7
    <e7e>   DW_AT_decl_line   : 433
    <e80>   DW_AT_decl_column : 17
    <e81>   DW_AT_type        : <0xb2d>
    <e85>   DW_AT_data_member_location: 0
 <2><e86>: Abbrev Number: 13 (DW_TAG_member)
    <e87>   DW_AT_name        : CR2
    <e8b>   DW_AT_decl_file   : 7
    <e8c>   DW_AT_decl_line   : 434
    <e8e>   DW_AT_decl_column : 17
    <e8f>   DW_AT_type        : <0xb2d>
    <e93>   DW_AT_data_member_location: 4
 <2><e94>: Abbrev Number: 14 (DW_TAG_member)
    <e95>   DW_AT_name        : (indirect string, offset: 0xbbe5d): OAR1
    <e99>   DW_AT_decl_file   : 7
    <e9a>   DW_AT_decl_line   : 435
    <e9c>   DW_AT_decl_column : 17
    <e9d>   DW_AT_type        : <0xb2d>
    <ea1>   DW_AT_data_member_location: 8
 <2><ea2>: Abbrev Number: 14 (DW_TAG_member)
    <ea3>   DW_AT_name        : (indirect string, offset: 0xbbe62): OAR2
    <ea7>   DW_AT_decl_file   : 7
    <ea8>   DW_AT_decl_line   : 436
    <eaa>   DW_AT_decl_column : 17
    <eab>   DW_AT_type        : <0xb2d>
    <eaf>   DW_AT_data_member_location: 12
 <2><eb0>: Abbrev Number: 14 (DW_TAG_member)
    <eb1>   DW_AT_name        : (indirect string, offset: 0xbcaa5): TIMINGR
    <eb5>   DW_AT_decl_file   : 7
    <eb6>   DW_AT_decl_line   : 437
    <eb8>   DW_AT_decl_column : 17
    <eb9>   DW_AT_type        : <0xb2d>
    <ebd>   DW_AT_data_member_location: 16
 <2><ebe>: Abbrev Number: 14 (DW_TAG_member)
    <ebf>   DW_AT_name        : (indirect string, offset: 0xbd0a7): TIMEOUTR
    <ec3>   DW_AT_decl_file   : 7
    <ec4>   DW_AT_decl_line   : 438
    <ec6>   DW_AT_decl_column : 17
    <ec7>   DW_AT_type        : <0xb2d>
    <ecb>   DW_AT_data_member_location: 20
 <2><ecc>: Abbrev Number: 13 (DW_TAG_member)
    <ecd>   DW_AT_name        : ISR
    <ed1>   DW_AT_decl_file   : 7
    <ed2>   DW_AT_decl_line   : 439
    <ed4>   DW_AT_decl_column : 17
    <ed5>   DW_AT_type        : <0xb2d>
    <ed9>   DW_AT_data_member_location: 24
 <2><eda>: Abbrev Number: 13 (DW_TAG_member)
    <edb>   DW_AT_name        : ICR
    <edf>   DW_AT_decl_file   : 7
    <ee0>   DW_AT_decl_line   : 440
    <ee2>   DW_AT_decl_column : 17
    <ee3>   DW_AT_type        : <0xb2d>
    <ee7>   DW_AT_data_member_location: 28
 <2><ee8>: Abbrev Number: 14 (DW_TAG_member)
    <ee9>   DW_AT_name        : (indirect string, offset: 0xbcda6): PECR
    <eed>   DW_AT_decl_file   : 7
    <eee>   DW_AT_decl_line   : 441
    <ef0>   DW_AT_decl_column : 17
    <ef1>   DW_AT_type        : <0xb2d>
    <ef5>   DW_AT_data_member_location: 32
 <2><ef6>: Abbrev Number: 14 (DW_TAG_member)
    <ef7>   DW_AT_name        : (indirect string, offset: 0xbd0f2): RXDR
    <efb>   DW_AT_decl_file   : 7
    <efc>   DW_AT_decl_line   : 442
    <efe>   DW_AT_decl_column : 17
    <eff>   DW_AT_type        : <0xb2d>
    <f03>   DW_AT_data_member_location: 36
 <2><f04>: Abbrev Number: 14 (DW_TAG_member)
    <f05>   DW_AT_name        : (indirect string, offset: 0xc1901): TXDR
    <f09>   DW_AT_decl_file   : 7
    <f0a>   DW_AT_decl_line   : 443
    <f0c>   DW_AT_decl_column : 17
    <f0d>   DW_AT_type        : <0xb2d>
    <f11>   DW_AT_data_member_location: 40
 <2><f12>: Abbrev Number: 0
 <1><f13>: Abbrev Number: 15 (DW_TAG_typedef)
    <f14>   DW_AT_name        : (indirect string, offset: 0xbd004): I2C_TypeDef
    <f18>   DW_AT_decl_file   : 7
    <f19>   DW_AT_decl_line   : 444
    <f1b>   DW_AT_decl_column : 3
    <f1c>   DW_AT_type        : <0xe6e>
 <1><f20>: Abbrev Number: 12 (DW_TAG_structure_type)
    <f21>   DW_AT_byte_size   : 148
    <f22>   DW_AT_decl_file   : 7
    <f23>   DW_AT_decl_line   : 491
    <f25>   DW_AT_decl_column : 9
    <f26>   DW_AT_sibling     : <0x1051>
 <2><f2a>: Abbrev Number: 13 (DW_TAG_member)
    <f2b>   DW_AT_name        : CR1
    <f2f>   DW_AT_decl_file   : 7
    <f30>   DW_AT_decl_line   : 493
    <f32>   DW_AT_decl_column : 17
    <f33>   DW_AT_type        : <0xb2d>
    <f37>   DW_AT_data_member_location: 0
 <2><f38>: Abbrev Number: 13 (DW_TAG_member)
    <f39>   DW_AT_name        : CR2
    <f3d>   DW_AT_decl_file   : 7
    <f3e>   DW_AT_decl_line   : 494
    <f40>   DW_AT_decl_column : 17
    <f41>   DW_AT_type        : <0xb2d>
    <f45>   DW_AT_data_member_location: 4
 <2><f46>: Abbrev Number: 13 (DW_TAG_member)
    <f47>   DW_AT_name        : CR3
    <f4b>   DW_AT_decl_file   : 7
    <f4c>   DW_AT_decl_line   : 495
    <f4e>   DW_AT_decl_column : 17
    <f4f>   DW_AT_type        : <0xb2d>
    <f53>   DW_AT_data_member_location: 8
 <2><f54>: Abbrev Number: 13 (DW_TAG_member)
    <f55>   DW_AT_name        : CR4
    <f59>   DW_AT_decl_file   : 7
    <f5a>   DW_AT_decl_line   : 496
    <f5c>   DW_AT_decl_column : 17
    <f5d>   DW_AT_type        : <0xb2d>
    <f61>   DW_AT_data_member_location: 12
 <2><f62>: Abbrev Number: 13 (DW_TAG_member)
    <f63>   DW_AT_name        : SR1
    <f67>   DW_AT_decl_file   : 7
    <f68>   DW_AT_decl_line   : 497
    <f6a>   DW_AT_decl_column : 17
    <f6b>   DW_AT_type        : <0xb2d>
    <f6f>   DW_AT_data_member_location: 16
 <2><f70>: Abbrev Number: 13 (DW_TAG_member)
    <f71>   DW_AT_name        : SR2
    <f75>   DW_AT_decl_file   : 7
    <f76>   DW_AT_decl_line   : 498
    <f78>   DW_AT_decl_column : 17
    <f79>   DW_AT_type        : <0xb2d>
    <f7d>   DW_AT_data_member_location: 20
 <2><f7e>: Abbrev Number: 13 (DW_TAG_member)
    <f7f>   DW_AT_name        : SCR
    <f83>   DW_AT_decl_file   : 7
    <f84>   DW_AT_decl_line   : 499
    <f86>   DW_AT_decl_column : 17
    <f87>   DW_AT_type        : <0xb2d>
    <f8b>   DW_AT_data_member_location: 24
 <2><f8c>: Abbrev Number: 13 (DW_TAG_member)
    <f8d>   DW_AT_name        : CR5
    <f91>   DW_AT_decl_file   : 7
    <f92>   DW_AT_decl_line   : 500
    <f94>   DW_AT_decl_column : 17
    <f95>   DW_AT_type        : <0xb2d>
    <f99>   DW_AT_data_member_location: 28
 <2><f9a>: Abbrev Number: 14 (DW_TAG_member)
    <f9b>   DW_AT_name        : (indirect string, offset: 0xbd522): PUCRA
    <f9f>   DW_AT_decl_file   : 7
    <fa0>   DW_AT_decl_line   : 501
    <fa2>   DW_AT_decl_column : 17
    <fa3>   DW_AT_type        : <0xb2d>
    <fa7>   DW_AT_data_member_location: 32
 <2><fa8>: Abbrev Number: 14 (DW_TAG_member)
    <fa9>   DW_AT_name        : (indirect string, offset: 0xbd137): PDCRA
    <fad>   DW_AT_decl_file   : 7
    <fae>   DW_AT_decl_line   : 502
    <fb0>   DW_AT_decl_column : 17
    <fb1>   DW_AT_type        : <0xb2d>
    <fb5>   DW_AT_data_member_location: 36
 <2><fb6>: Abbrev Number: 14 (DW_TAG_member)
    <fb7>   DW_AT_name        : (indirect string, offset: 0xbccef): PUCRB
    <fbb>   DW_AT_decl_file   : 7
    <fbc>   DW_AT_decl_line   : 503
    <fbe>   DW_AT_decl_column : 17
    <fbf>   DW_AT_type        : <0xb2d>
    <fc3>   DW_AT_data_member_location: 40
 <2><fc4>: Abbrev Number: 14 (DW_TAG_member)
    <fc5>   DW_AT_name        : (indirect string, offset: 0xbd13d): PDCRB
    <fc9>   DW_AT_decl_file   : 7
    <fca>   DW_AT_decl_line   : 504
    <fcc>   DW_AT_decl_column : 17
    <fcd>   DW_AT_type        : <0xb2d>
    <fd1>   DW_AT_data_member_location: 44
 <2><fd2>: Abbrev Number: 14 (DW_TAG_member)
    <fd3>   DW_AT_name        : (indirect string, offset: 0xbd528): PUCRC
    <fd7>   DW_AT_decl_file   : 7
    <fd8>   DW_AT_decl_line   : 505
    <fda>   DW_AT_decl_column : 17
    <fdb>   DW_AT_type        : <0xb2d>
    <fdf>   DW_AT_data_member_location: 48
 <2><fe0>: Abbrev Number: 14 (DW_TAG_member)
    <fe1>   DW_AT_name        : (indirect string, offset: 0xbd143): PDCRC
    <fe5>   DW_AT_decl_file   : 7
    <fe6>   DW_AT_decl_line   : 506
    <fe8>   DW_AT_decl_column : 17
    <fe9>   DW_AT_type        : <0xb2d>
    <fed>   DW_AT_data_member_location: 52
 <2><fee>: Abbrev Number: 14 (DW_TAG_member)
    <fef>   DW_AT_name        : (indirect string, offset: 0xbd45d): RESERVED0
    <ff3>   DW_AT_decl_file   : 7
    <ff4>   DW_AT_decl_line   : 507
    <ff6>   DW_AT_decl_column : 17
    <ff7>   DW_AT_type        : <0xb32>
    <ffb>   DW_AT_data_member_location: 56
 <2><ffc>: Abbrev Number: 14 (DW_TAG_member)
    <ffd>   DW_AT_name        : (indirect string, offset: 0xbd52e): PUCRH
    <1001>   DW_AT_decl_file   : 7
    <1002>   DW_AT_decl_line   : 508
    <1004>   DW_AT_decl_column : 17
    <1005>   DW_AT_type        : <0xb2d>
    <1009>   DW_AT_data_member_location: 88
 <2><100a>: Abbrev Number: 14 (DW_TAG_member)
    <100b>   DW_AT_name        : (indirect string, offset: 0xbd149): PDCRH
    <100f>   DW_AT_decl_file   : 7
    <1010>   DW_AT_decl_line   : 509
    <1012>   DW_AT_decl_column : 17
    <1013>   DW_AT_type        : <0xb2d>
    <1017>   DW_AT_data_member_location: 92
 <2><1018>: Abbrev Number: 14 (DW_TAG_member)
    <1019>   DW_AT_name        : (indirect string, offset: 0xbd467): RESERVED1
    <101d>   DW_AT_decl_file   : 7
    <101e>   DW_AT_decl_line   : 510
    <1020>   DW_AT_decl_column : 17
    <1021>   DW_AT_type        : <0x1051>
    <1025>   DW_AT_data_member_location: 96
 <2><1026>: Abbrev Number: 14 (DW_TAG_member)
    <1027>   DW_AT_name        : (indirect string, offset: 0xbbe42): EXTSCR
    <102b>   DW_AT_decl_file   : 7
    <102c>   DW_AT_decl_line   : 511
    <102e>   DW_AT_decl_column : 17
    <102f>   DW_AT_type        : <0xb2d>
    <1033>   DW_AT_data_member_location: 136
 <2><1034>: Abbrev Number: 14 (DW_TAG_member)
    <1035>   DW_AT_name        : (indirect string, offset: 0xbd471): RESERVED2
    <1039>   DW_AT_decl_file   : 7
    <103a>   DW_AT_decl_line   : 512
    <103c>   DW_AT_decl_column : 17
    <103d>   DW_AT_type        : <0xb21>
    <1041>   DW_AT_data_member_location: 140
 <2><1042>: Abbrev Number: 14 (DW_TAG_member)
    <1043>   DW_AT_name        : (indirect string, offset: 0xbd592): SUBGHZSPICR
    <1047>   DW_AT_decl_file   : 7
    <1048>   DW_AT_decl_line   : 513
    <104a>   DW_AT_decl_column : 17
    <104b>   DW_AT_type        : <0xb2d>
    <104f>   DW_AT_data_member_location: 144
 <2><1050>: Abbrev Number: 0
 <1><1051>: Abbrev Number: 7 (DW_TAG_array_type)
    <1052>   DW_AT_type        : <0xb21>
    <1056>   DW_AT_sibling     : <0x1061>
 <2><105a>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <105b>   DW_AT_type        : <0xaf8>
    <105f>   DW_AT_upper_bound : 9
 <2><1060>: Abbrev Number: 0
 <1><1061>: Abbrev Number: 15 (DW_TAG_typedef)
    <1062>   DW_AT_name        : (indirect string, offset: 0xbce46): PWR_TypeDef
    <1066>   DW_AT_decl_file   : 7
    <1067>   DW_AT_decl_line   : 514
    <1069>   DW_AT_decl_column : 3
    <106a>   DW_AT_type        : <0xf20>
 <1><106e>: Abbrev Number: 16 (DW_TAG_structure_type)
    <106f>   DW_AT_byte_size   : 268
    <1071>   DW_AT_decl_file   : 7
    <1072>   DW_AT_decl_line   : 519
    <1074>   DW_AT_decl_column : 9
    <1075>   DW_AT_sibling     : <0x12aa>
 <2><1079>: Abbrev Number: 13 (DW_TAG_member)
    <107a>   DW_AT_name        : CR
    <107d>   DW_AT_decl_file   : 7
    <107e>   DW_AT_decl_line   : 521
    <1080>   DW_AT_decl_column : 17
    <1081>   DW_AT_type        : <0xb2d>
    <1085>   DW_AT_data_member_location: 0
 <2><1086>: Abbrev Number: 14 (DW_TAG_member)
    <1087>   DW_AT_name        : (indirect string, offset: 0xbca44): ICSCR
    <108b>   DW_AT_decl_file   : 7
    <108c>   DW_AT_decl_line   : 522
    <108e>   DW_AT_decl_column : 17
    <108f>   DW_AT_type        : <0xb2d>
    <1093>   DW_AT_data_member_location: 4
 <2><1094>: Abbrev Number: 14 (DW_TAG_member)
    <1095>   DW_AT_name        : (indirect string, offset: 0xbce0f): CFGR
    <1099>   DW_AT_decl_file   : 7
    <109a>   DW_AT_decl_line   : 523
    <109c>   DW_AT_decl_column : 17
    <109d>   DW_AT_type        : <0xb2d>
    <10a1>   DW_AT_data_member_location: 8
 <2><10a2>: Abbrev Number: 14 (DW_TAG_member)
    <10a3>   DW_AT_name        : (indirect string, offset: 0xbce0c): PLLCFGR
    <10a7>   DW_AT_decl_file   : 7
    <10a8>   DW_AT_decl_line   : 524
    <10aa>   DW_AT_decl_column : 17
    <10ab>   DW_AT_type        : <0xb2d>
    <10af>   DW_AT_data_member_location: 12
 <2><10b0>: Abbrev Number: 14 (DW_TAG_member)
    <10b1>   DW_AT_name        : (indirect string, offset: 0xbd45d): RESERVED0
    <10b5>   DW_AT_decl_file   : 7
    <10b6>   DW_AT_decl_line   : 525
    <10b8>   DW_AT_decl_column : 10
    <10b9>   DW_AT_type        : <0xb21>
    <10bd>   DW_AT_data_member_location: 16
 <2><10be>: Abbrev Number: 14 (DW_TAG_member)
    <10bf>   DW_AT_name        : (indirect string, offset: 0xbd467): RESERVED1
    <10c3>   DW_AT_decl_file   : 7
    <10c4>   DW_AT_decl_line   : 526
    <10c6>   DW_AT_decl_column : 10
    <10c7>   DW_AT_type        : <0xb21>
    <10cb>   DW_AT_data_member_location: 20
 <2><10cc>: Abbrev Number: 14 (DW_TAG_member)
    <10cd>   DW_AT_name        : (indirect string, offset: 0xbbb34): CIER
    <10d1>   DW_AT_decl_file   : 7
    <10d2>   DW_AT_decl_line   : 527
    <10d4>   DW_AT_decl_column : 17
    <10d5>   DW_AT_type        : <0xb2d>
    <10d9>   DW_AT_data_member_location: 24
 <2><10da>: Abbrev Number: 14 (DW_TAG_member)
    <10db>   DW_AT_name        : (indirect string, offset: 0xbbb46): CIFR
    <10df>   DW_AT_decl_file   : 7
    <10e0>   DW_AT_decl_line   : 528
    <10e2>   DW_AT_decl_column : 17
    <10e3>   DW_AT_type        : <0xb2d>
    <10e7>   DW_AT_data_member_location: 28
 <2><10e8>: Abbrev Number: 14 (DW_TAG_member)
    <10e9>   DW_AT_name        : (indirect string, offset: 0xbbb24): CICR
    <10ed>   DW_AT_decl_file   : 7
    <10ee>   DW_AT_decl_line   : 529
    <10f0>   DW_AT_decl_column : 17
    <10f1>   DW_AT_type        : <0xb2d>
    <10f5>   DW_AT_data_member_location: 32
 <2><10f6>: Abbrev Number: 14 (DW_TAG_member)
    <10f7>   DW_AT_name        : (indirect string, offset: 0xbd471): RESERVED2
    <10fb>   DW_AT_decl_file   : 7
    <10fc>   DW_AT_decl_line   : 530
    <10fe>   DW_AT_decl_column : 10
    <10ff>   DW_AT_type        : <0xb21>
    <1103>   DW_AT_data_member_location: 36
 <2><1104>: Abbrev Number: 14 (DW_TAG_member)
    <1105>   DW_AT_name        : (indirect string, offset: 0xbd03d): AHB1RSTR
    <1109>   DW_AT_decl_file   : 7
    <110a>   DW_AT_decl_line   : 531
    <110c>   DW_AT_decl_column : 17
    <110d>   DW_AT_type        : <0xb2d>
    <1111>   DW_AT_data_member_location: 40
 <2><1112>: Abbrev Number: 14 (DW_TAG_member)
    <1113>   DW_AT_name        : (indirect string, offset: 0xbbd2c): AHB2RSTR
    <1117>   DW_AT_decl_file   : 7
    <1118>   DW_AT_decl_line   : 532
    <111a>   DW_AT_decl_column : 17
    <111b>   DW_AT_type        : <0xb2d>
    <111f>   DW_AT_data_member_location: 44
 <2><1120>: Abbrev Number: 14 (DW_TAG_member)
    <1121>   DW_AT_name        : (indirect string, offset: 0xbc360): AHB3RSTR
    <1125>   DW_AT_decl_file   : 7
    <1126>   DW_AT_decl_line   : 533
    <1128>   DW_AT_decl_column : 17
    <1129>   DW_AT_type        : <0xb2d>
    <112d>   DW_AT_data_member_location: 48
 <2><112e>: Abbrev Number: 14 (DW_TAG_member)
    <112f>   DW_AT_name        : (indirect string, offset: 0xbd47b): RESERVED3
    <1133>   DW_AT_decl_file   : 7
    <1134>   DW_AT_decl_line   : 534
    <1136>   DW_AT_decl_column : 10
    <1137>   DW_AT_type        : <0xb21>
    <113b>   DW_AT_data_member_location: 52
 <2><113c>: Abbrev Number: 14 (DW_TAG_member)
    <113d>   DW_AT_name        : (indirect string, offset: 0xbc020): APB1RSTR1
    <1141>   DW_AT_decl_file   : 7
    <1142>   DW_AT_decl_line   : 535
    <1144>   DW_AT_decl_column : 17
    <1145>   DW_AT_type        : <0xb2d>
    <1149>   DW_AT_data_member_location: 56
 <2><114a>: Abbrev Number: 14 (DW_TAG_member)
    <114b>   DW_AT_name        : (indirect string, offset: 0xbc02a): APB1RSTR2
    <114f>   DW_AT_decl_file   : 7
    <1150>   DW_AT_decl_line   : 536
    <1152>   DW_AT_decl_column : 17
    <1153>   DW_AT_type        : <0xb2d>
    <1157>   DW_AT_data_member_location: 60
 <2><1158>: Abbrev Number: 14 (DW_TAG_member)
    <1159>   DW_AT_name        : (indirect string, offset: 0xbc69a): APB2RSTR
    <115d>   DW_AT_decl_file   : 7
    <115e>   DW_AT_decl_line   : 537
    <1160>   DW_AT_decl_column : 17
    <1161>   DW_AT_type        : <0xb2d>
    <1165>   DW_AT_data_member_location: 64
 <2><1166>: Abbrev Number: 14 (DW_TAG_member)
    <1167>   DW_AT_name        : (indirect string, offset: 0xbcf18): APB3RSTR
    <116b>   DW_AT_decl_file   : 7
    <116c>   DW_AT_decl_line   : 538
    <116e>   DW_AT_decl_column : 17
    <116f>   DW_AT_type        : <0xb2d>
    <1173>   DW_AT_data_member_location: 68
 <2><1174>: Abbrev Number: 14 (DW_TAG_member)
    <1175>   DW_AT_name        : (indirect string, offset: 0xbbcac): AHB1ENR
    <1179>   DW_AT_decl_file   : 7
    <117a>   DW_AT_decl_line   : 539
    <117c>   DW_AT_decl_column : 17
    <117d>   DW_AT_type        : <0xb2d>
    <1181>   DW_AT_data_member_location: 72
 <2><1182>: Abbrev Number: 14 (DW_TAG_member)
    <1183>   DW_AT_name        : (indirect string, offset: 0xbc194): AHB2ENR
    <1187>   DW_AT_decl_file   : 7
    <1188>   DW_AT_decl_line   : 540
    <118a>   DW_AT_decl_column : 17
    <118b>   DW_AT_type        : <0xb2d>
    <118f>   DW_AT_data_member_location: 76
 <2><1190>: Abbrev Number: 14 (DW_TAG_member)
    <1191>   DW_AT_name        : (indirect string, offset: 0xbc711): AHB3ENR
    <1195>   DW_AT_decl_file   : 7
    <1196>   DW_AT_decl_line   : 541
    <1198>   DW_AT_decl_column : 17
    <1199>   DW_AT_type        : <0xb2d>
    <119d>   DW_AT_data_member_location: 80
 <2><119e>: Abbrev Number: 14 (DW_TAG_member)
    <119f>   DW_AT_name        : (indirect string, offset: 0xbcaed): RESERVED4
    <11a3>   DW_AT_decl_file   : 7
    <11a4>   DW_AT_decl_line   : 542
    <11a6>   DW_AT_decl_column : 10
    <11a7>   DW_AT_type        : <0xb21>
    <11ab>   DW_AT_data_member_location: 84
 <2><11ac>: Abbrev Number: 14 (DW_TAG_member)
    <11ad>   DW_AT_name        : (indirect string, offset: 0xbbbb9): APB1ENR1
    <11b1>   DW_AT_decl_file   : 7
    <11b2>   DW_AT_decl_line   : 543
    <11b4>   DW_AT_decl_column : 17
    <11b5>   DW_AT_type        : <0xb2d>
    <11b9>   DW_AT_data_member_location: 88
 <2><11ba>: Abbrev Number: 14 (DW_TAG_member)
    <11bb>   DW_AT_name        : (indirect string, offset: 0xbbbc2): APB1ENR2
    <11bf>   DW_AT_decl_file   : 7
    <11c0>   DW_AT_decl_line   : 544
    <11c2>   DW_AT_decl_column : 17
    <11c3>   DW_AT_type        : <0xb2d>
    <11c7>   DW_AT_data_member_location: 92
 <2><11c8>: Abbrev Number: 14 (DW_TAG_member)
    <11c9>   DW_AT_name        : (indirect string, offset: 0xbbd4c): APB2ENR
    <11cd>   DW_AT_decl_file   : 7
    <11ce>   DW_AT_decl_line   : 545
